QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
/*
 * [Warning!] This file is auto-generated by pika compiler.
 * Do not edit it manually.
 * The source code is *.pyi file.
 * More details: 
 * English Doc:
 * https://pikadoc.readthedocs.io/en/latest/PikaScript%20%E6%A8%A1%E5%9D%97%E6%A6%82%E8%BF%B0.html
 * Chinese Doc:
 * https://pikadoc.readthedocs.io/zh/latest/PikaScript%20%E6%A8%A1%E5%9D%97%E6%A6%82%E8%BF%B0.html
 */

#include <stdio.h>
#include <stdlib.h>
#include "BaseObj.h"
#include "PikaDebug.h"
#include "TinyObj.h"
#include "PikaDebug_Debuger.h"
#include "TinyObj.h"
#include "PikaMain.h"
#include "PikaStdLib_SysObj.h"
#include "PikaStdLib.h"
#include "PikaMath.h"
#include "TinyObj.h"
#include "PikaMath_Math.h"
#include "TinyObj.h"
#include "PikaMath_Operator.h"
#include "TinyObj.h"
#include "PikaMath_Quaternion.h"
#include "TinyObj.h"
#include "PikaStdData.h"
#include "TinyObj.h"
#include "PikaStdData_ByteArray.h"
#include "TinyObj.h"
#include "PikaStdData_Dict.h"
#include "TinyObj.h"
#include "PikaStdData_FILEIO.h"
#include "TinyObj.h"
#include "PikaStdData_List.h"
#include "PikaStdData_Tuple.h"
#include "PikaStdData_String.h"
#include "TinyObj.h"
#include "PikaStdData_Tuple.h"
#include "TinyObj.h"
#include "PikaStdData_Utils.h"
#include "TinyObj.h"
#include "PikaStdData_dict_items.h"
#include "TinyObj.h"
#include "PikaStdData_dict_keys.h"
#include "TinyObj.h"
#include "PikaStdDevice.h"
#include "TinyObj.h"
#include "PikaStdDevice_ADC.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_BaseDev.h"
#include "TinyObj.h"
#include "PikaStdDevice_CAN.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_GPIO.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_IIC.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_PWM.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_SPI.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_Time.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdDevice_UART.h"
#include "PikaStdDevice_BaseDev.h"
#include "PikaStdLib.h"
#include "TinyObj.h"
#include "PikaStdLib_MemChecker.h"
#include "TinyObj.h"
#include "PikaStdLib_RangeObj.h"
#include "TinyObj.h"
#include "PikaStdLib_StringObj.h"
#include "TinyObj.h"
#include "PikaStdLib_SysObj.h"
#include "TinyObj.h"
#include "PikaStdTask.h"
#include "TinyObj.h"
#include "PikaStdTask_Task.h"
#include "PikaStdLib_SysObj.h"
#include "PikaStdData_List.h"
#include "STM32F1.h"
#include "TinyObj.h"
#include "STM32F1_ADC.h"
#include "PikaStdDevice_ADC.h"
#include "STM32F1_GPIO.h"
#include "PikaStdDevice_GPIO.h"
#include "STM32F1_IIC.h"
#include "PikaStdDevice_IIC.h"
#include "STM32F1_GPIO.h"
#include "STM32F1_GPIO.h"
#include "STM32F1_PWM.h"
#include "PikaStdDevice_PWM.h"
#include "STM32F1_Time.h"
#include "PikaStdDevice_Time.h"
#include "STM32F1_UART.h"
#include "PikaStdDevice_UART.h"
#include "STM32F1_lowLevel.h"
#include "TinyObj.h"

#ifndef PIKA_MODULE_PIKADEBUG_DISABLE
void PikaDebug_DebugerMethod(PikaObj *self, Args *args){
    Arg* res = PikaDebug_Debuger(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaDebug_Debuger,
    "Debuger", ""
);

class_def(PikaDebug){
    __BEFORE_MOETHOD_DEF
    constructor_def(PikaDebug_Debuger, 1761613187),
};
class_inhert(PikaDebug, TinyObj);

PikaObj *New_PikaDebug(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaDebug);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKADEBUG_DISABLE
void PikaDebug_Debuger___init__Method(PikaObj *self, Args *args){
    PikaDebug_Debuger___init__(self);
}
method_typedef(
    PikaDebug_Debuger___init__,
    "__init__", ""
);

void PikaDebug_Debuger_set_traceMethod(PikaObj *self, Args *args){
    PikaDebug_Debuger_set_trace(self);
}
method_typedef(
    PikaDebug_Debuger_set_trace,
    "set_trace", ""
);

class_def(PikaDebug_Debuger){
    __BEFORE_MOETHOD_DEF
    method_def(PikaDebug_Debuger___init__, 904762485),
    method_def(PikaDebug_Debuger_set_trace, 1131228543),
};
class_inhert(PikaDebug_Debuger, TinyObj);

PikaObj *New_PikaDebug_Debuger(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaDebug_Debuger);
    return self;
}

Arg *PikaDebug_Debuger(PikaObj *self){
    return obj_newObjInPackage(New_PikaDebug_Debuger);
}
#endif

#ifndef PIKA_MODULE_MAIN_DISABLE
class_def(PikaMain){
    __BEFORE_MOETHOD_DEF
};
class_inhert(PikaMain, PikaStdLib_SysObj);

PikaObj *New_PikaMain(Args *args){
    PikaObj *self = New_PikaStdLib_SysObj(args);
    obj_newObj(self, "PikaStdLib", "PikaStdLib", New_PikaStdLib);
    obj_setClass(self, PikaMain);
    return self;
}

Arg *PikaMain(PikaObj *self){
    return obj_newObjInPackage(New_PikaMain);
}
#endif

#ifndef PIKA_MODULE_PIKAMATH_DISABLE
void PikaMath_MathMethod(PikaObj *self, Args *args){
    Arg* res = PikaMath_Math(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaMath_Math,
    "Math", ""
);

void PikaMath_OperatorMethod(PikaObj *self, Args *args){
    Arg* res = PikaMath_Operator(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaMath_Operator,
    "Operator", ""
);

void PikaMath_QuaternionMethod(PikaObj *self, Args *args){
    Arg* res = PikaMath_Quaternion(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaMath_Quaternion,
    "Quaternion", ""
);

class_def(PikaMath){
    __BEFORE_MOETHOD_DEF
    constructor_def(PikaMath_Operator, 90025425),
    constructor_def(PikaMath_Quaternion, 337686763),
    constructor_def(PikaMath_Math, 2089350319),
};
class_inhert(PikaMath, TinyObj);

PikaObj *New_PikaMath(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaMath);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKAMATH_DISABLE
void PikaMath_Math___init__Method(PikaObj *self, Args *args){
    PikaMath_Math___init__(self);
}
method_typedef(
    PikaMath_Math___init__,
    "__init__", ""
);

void PikaMath_Math_acosMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_acos(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_acos,
    "acos", "x"
);

void PikaMath_Math_asinMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_asin(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_asin,
    "asin", "x"
);

