QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
void PikaMath_Math_atanMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_atan(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_atan,
    "atan", "x"
);

void PikaMath_Math_atan2Method(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float y = args_getFloat(args, "y");
    pika_float res = PikaMath_Math_atan2(self, x, y);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_atan2,
    "atan2", "x,y"
);

void PikaMath_Math_ceilMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    int res = PikaMath_Math_ceil(self, x);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Math_ceil,
    "ceil", "x"
);

void PikaMath_Math_cosMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_cos(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_cos,
    "cos", "x"
);

void PikaMath_Math_coshMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_cosh(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_cosh,
    "cosh", "x"
);

void PikaMath_Math_degreesMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_degrees(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_degrees,
    "degrees", "x"
);

void PikaMath_Math_expMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_exp(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_exp,
    "exp", "x"
);

void PikaMath_Math_fabsMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_fabs(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_fabs,
    "fabs", "x"
);

void PikaMath_Math_floorMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    int res = PikaMath_Math_floor(self, x);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Math_floor,
    "floor", "x"
);

void PikaMath_Math_fmodMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float y = args_getFloat(args, "y");
    pika_float res = PikaMath_Math_fmod(self, x, y);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_fmod,
    "fmod", "x,y"
);

void PikaMath_Math_logMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_log(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_log,
    "log", "x"
);

void PikaMath_Math_log10Method(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_log10(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_log10,
    "log10", "x"
);

void PikaMath_Math_log2Method(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_log2(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_log2,
    "log2", "x"
);

void PikaMath_Math_powMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float y = args_getFloat(args, "y");
    pika_float res = PikaMath_Math_pow(self, x, y);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_pow,
    "pow", "x,y"
);

void PikaMath_Math_radiansMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_radians(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_radians,
    "radians", "x"
);

void PikaMath_Math_remainderMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float y = args_getFloat(args, "y");
    pika_float res = PikaMath_Math_remainder(self, x, y);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_remainder,
    "remainder", "x,y"
);

void PikaMath_Math_sinMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_sin(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_sin,
    "sin", "x"
);

void PikaMath_Math_sinhMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_sinh(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_sinh,
    "sinh", "x"
);

void PikaMath_Math_sqrtMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_sqrt(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_sqrt,
    "sqrt", "x"
);

void PikaMath_Math_tanMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_tan(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_tan,
    "tan", "x"
);

void PikaMath_Math_tanhMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_tanh(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_tanh,
    "tanh", "x"
);

void PikaMath_Math_truncMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float res = PikaMath_Math_trunc(self, x);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Math_trunc,
    "trunc", "x"
);

class_def(PikaMath_Math){
    __BEFORE_MOETHOD_DEF
    method_def(PikaMath_Math_degrees, 144734852),
    method_def(PikaMath_Math_cos, 193488586),
    method_def(PikaMath_Math_exp, 193491058),
    method_def(PikaMath_Math_log, 193498375),
    method_def(PikaMath_Math_pow, 193502747),
    method_def(PikaMath_Math_sin, 193505807),
    method_def(PikaMath_Math_tan, 193506632),
    method_def(PikaMath_Math_atan2, 253464571),
    method_def(PikaMath_Math_floor, 259122023),
    method_def(PikaMath_Math_log10, 266334536),
    method_def(PikaMath_Math_trunc, 275947025),
    method_def(PikaMath_Math_radians, 884990407),
    method_def(PikaMath_Math___init__, 904762485),
    method_def(PikaMath_Math_remainder, 939143804),
    method_def(PikaMath_Math_acos, 2090071083),
    method_def(PikaMath_Math_asin, 2090088304),
    method_def(PikaMath_Math_atan, 2090089129),
    method_def(PikaMath_Math_ceil, 2090144930),
    method_def(PikaMath_Math_cosh, 2090156146),
    method_def(PikaMath_Math_fabs, 2090248161),
    method_def(PikaMath_Math_fmod, 2090261643),
    method_def(PikaMath_Math_log2, 2090479129),
    method_def(PikaMath_Math_sinh, 2090724439),
    method_def(PikaMath_Math_sqrt, 2090733295),
    method_def(PikaMath_Math_tanh, 2090751664),
};
class_inhert(PikaMath_Math, TinyObj);

PikaObj *New_PikaMath_Math(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaMath_Math);
    return self;
}

Arg *PikaMath_Math(PikaObj *self){
    return obj_newObjInPackage(New_PikaMath_Math);
}
#endif

#ifndef PIKA_MODULE_PIKAMATH_DISABLE
void PikaMath_Operator_ANDMethod(PikaObj *self, Args *args){
    int flag1 = args_getInt(args, "flag1");
    int flag2 = args_getInt(args, "flag2");
    int res = PikaMath_Operator_AND(self, flag1, flag2);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Operator_AND,
    "AND", "flag1,flag2"
);

void PikaMath_Operator_NOTMethod(PikaObj *self, Args *args){
    int flag = args_getInt(args, "flag");
    int res = PikaMath_Operator_NOT(self, flag);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Operator_NOT,
    "NOT", "flag"
);

