QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
void PikaMath_Operator_ORMethod(PikaObj *self, Args *args){
    int flag1 = args_getInt(args, "flag1");
    int flag2 = args_getInt(args, "flag2");
    int res = PikaMath_Operator_OR(self, flag1, flag2);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Operator_OR,
    "OR", "flag1,flag2"
);

void PikaMath_Operator___del__Method(PikaObj *self, Args *args){
    PikaMath_Operator___del__(self);
}
method_typedef(
    PikaMath_Operator___del__,
    "__del__", ""
);

void PikaMath_Operator___str__Method(PikaObj *self, Args *args){
    char* res = PikaMath_Operator___str__(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaMath_Operator___str__,
    "__str__", ""
);

void PikaMath_Operator_equalFloatMethod(PikaObj *self, Args *args){
    pika_float num1 = args_getFloat(args, "num1");
    pika_float num2 = args_getFloat(args, "num2");
    int res = PikaMath_Operator_equalFloat(self, num1, num2);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Operator_equalFloat,
    "equalFloat", "num1,num2"
);

void PikaMath_Operator_equalIntMethod(PikaObj *self, Args *args){
    int num1 = args_getInt(args, "num1");
    int num2 = args_getInt(args, "num2");
    int res = PikaMath_Operator_equalInt(self, num1, num2);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Operator_equalInt,
    "equalInt", "num1,num2"
);

void PikaMath_Operator_graterThanFloatMethod(PikaObj *self, Args *args){
    pika_float num1 = args_getFloat(args, "num1");
    pika_float num2 = args_getFloat(args, "num2");
    int res = PikaMath_Operator_graterThanFloat(self, num1, num2);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Operator_graterThanFloat,
    "graterThanFloat", "num1,num2"
);

void PikaMath_Operator_graterThanIntMethod(PikaObj *self, Args *args){
    int num1 = args_getInt(args, "num1");
    int num2 = args_getInt(args, "num2");
    int res = PikaMath_Operator_graterThanInt(self, num1, num2);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Operator_graterThanInt,
    "graterThanInt", "num1,num2"
);

void PikaMath_Operator_lessThanFloatMethod(PikaObj *self, Args *args){
    pika_float num1 = args_getFloat(args, "num1");
    pika_float num2 = args_getFloat(args, "num2");
    int res = PikaMath_Operator_lessThanFloat(self, num1, num2);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Operator_lessThanFloat,
    "lessThanFloat", "num1,num2"
);

void PikaMath_Operator_lessThanIntMethod(PikaObj *self, Args *args){
    int num1 = args_getInt(args, "num1");
    int num2 = args_getInt(args, "num2");
    int res = PikaMath_Operator_lessThanInt(self, num1, num2);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Operator_lessThanInt,
    "lessThanInt", "num1,num2"
);

void PikaMath_Operator_minusFloatMethod(PikaObj *self, Args *args){
    pika_float num1 = args_getFloat(args, "num1");
    pika_float num2 = args_getFloat(args, "num2");
    pika_float res = PikaMath_Operator_minusFloat(self, num1, num2);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Operator_minusFloat,
    "minusFloat", "num1,num2"
);

void PikaMath_Operator_minusIntMethod(PikaObj *self, Args *args){
    int num1 = args_getInt(args, "num1");
    int num2 = args_getInt(args, "num2");
    int res = PikaMath_Operator_minusInt(self, num1, num2);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Operator_minusInt,
    "minusInt", "num1,num2"
);

void PikaMath_Operator_plusFloatMethod(PikaObj *self, Args *args){
    pika_float num1 = args_getFloat(args, "num1");
    pika_float num2 = args_getFloat(args, "num2");
    pika_float res = PikaMath_Operator_plusFloat(self, num1, num2);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Operator_plusFloat,
    "plusFloat", "num1,num2"
);

void PikaMath_Operator_plusIntMethod(PikaObj *self, Args *args){
    int num1 = args_getInt(args, "num1");
    int num2 = args_getInt(args, "num2");
    int res = PikaMath_Operator_plusInt(self, num1, num2);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Operator_plusInt,
    "plusInt", "num1,num2"
);

class_def(PikaMath_Operator){
    __BEFORE_MOETHOD_DEF
    method_def(PikaMath_Operator_OR, 5862598),
    method_def(PikaMath_Operator_AND, 193450424),
    method_def(PikaMath_Operator_NOT, 193464630),
    method_def(PikaMath_Operator_minusInt, 796579292),
    method_def(PikaMath_Operator_plusInt, 900521332),
    method_def(PikaMath_Operator_graterThanFloat, 1027140939),
    method_def(PikaMath_Operator_equalInt, 1143238792),
    method_def(PikaMath_Operator_plusFloat, 1411555295),
    method_def(PikaMath_Operator_lessThanFloat, 1453828157),
    method_def(PikaMath_Operator_equalFloat, 1590380531),
    method_def(PikaMath_Operator_graterThanInt, 1807278048),
    method_def(PikaMath_Operator_lessThanInt, 2012755538),
    method_def(PikaMath_Operator_minusFloat, 2035307079),
    method_def(PikaMath_Operator___del__, 2038499702),
    method_def(PikaMath_Operator___str__, 2056834106),
};
class_inhert(PikaMath_Operator, TinyObj);

PikaObj *New_PikaMath_Operator(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaMath_Operator);
    return self;
}

Arg *PikaMath_Operator(PikaObj *self){
    return obj_newObjInPackage(New_PikaMath_Operator);
}
#endif

#ifndef PIKA_MODULE_PIKAMATH_DISABLE
void PikaMath_Quaternion___init__Method(PikaObj *self, Args *args){
    PikaMath_Quaternion___init__(self);
}
method_typedef(
    PikaMath_Quaternion___init__,
    "__init__", ""
);

void PikaMath_Quaternion_addMethod(PikaObj *self, Args *args){
    PikaObj* quat = args_getPtr(args, "quat");
    PikaMath_Quaternion_add(self, quat);
}
method_typedef(
    PikaMath_Quaternion_add,
    "add", "quat"
);

void PikaMath_Quaternion_crossproductMethod(PikaObj *self, Args *args){
    PikaObj* quat = args_getPtr(args, "quat");
    PikaMath_Quaternion_crossproduct(self, quat);
}
method_typedef(
    PikaMath_Quaternion_crossproduct,
    "crossproduct", "quat"
);

void PikaMath_Quaternion_dotMethod(PikaObj *self, Args *args){
    PikaObj* quat = args_getPtr(args, "quat");
    pika_float res = PikaMath_Quaternion_dot(self, quat);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Quaternion_dot,
    "dot", "quat"
);

void PikaMath_Quaternion_fromEulerMethod(PikaObj *self, Args *args){
    pika_float yaw = args_getFloat(args, "yaw");
    pika_float pitch = args_getFloat(args, "pitch");
    pika_float roll = args_getFloat(args, "roll");
    int mode = args_getInt(args, "mode");
    PikaMath_Quaternion_fromEuler(self, yaw, pitch, roll, mode);
}
method_typedef(
    PikaMath_Quaternion_fromEuler,
    "fromEuler", "yaw,pitch,roll,mode"
);

void PikaMath_Quaternion_getMethod(PikaObj *self, Args *args){
    int key = args_getInt(args, "key");
    pika_float res = PikaMath_Quaternion_get(self, key);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Quaternion_get,
    "get", "key"
);

