QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
void PikaMath_Quaternion_inverseMethod(PikaObj *self, Args *args){
    PikaMath_Quaternion_inverse(self);
}
method_typedef(
    PikaMath_Quaternion_inverse,
    "inverse", ""
);

void PikaMath_Quaternion_isnormalizeMethod(PikaObj *self, Args *args){
    int res = PikaMath_Quaternion_isnormalize(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaMath_Quaternion_isnormalize,
    "isnormalize", ""
);

void PikaMath_Quaternion_magnitudedMethod(PikaObj *self, Args *args){
    pika_float res = PikaMath_Quaternion_magnituded(self);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Quaternion_magnituded,
    "magnituded", ""
);

void PikaMath_Quaternion_magnitudedsquareMethod(PikaObj *self, Args *args){
    pika_float res = PikaMath_Quaternion_magnitudedsquare(self);
    method_returnFloat(args, res);
}
method_typedef(
    PikaMath_Quaternion_magnitudedsquare,
    "magnitudedsquare", ""
);

void PikaMath_Quaternion_mulMethod(PikaObj *self, Args *args){
    PikaObj* quat = args_getPtr(args, "quat");
    PikaMath_Quaternion_mul(self, quat);
}
method_typedef(
    PikaMath_Quaternion_mul,
    "mul", "quat"
);

void PikaMath_Quaternion_normalizeMethod(PikaObj *self, Args *args){
    PikaMath_Quaternion_normalize(self);
}
method_typedef(
    PikaMath_Quaternion_normalize,
    "normalize", ""
);

void PikaMath_Quaternion_reverseMethod(PikaObj *self, Args *args){
    PikaMath_Quaternion_reverse(self);
}
method_typedef(
    PikaMath_Quaternion_reverse,
    "reverse", ""
);

void PikaMath_Quaternion_setMethod(PikaObj *self, Args *args){
    pika_float x = args_getFloat(args, "x");
    pika_float y = args_getFloat(args, "y");
    pika_float z = args_getFloat(args, "z");
    pika_float w = args_getFloat(args, "w");
    PikaMath_Quaternion_set(self, x, y, z, w);
}
method_typedef(
    PikaMath_Quaternion_set,
    "set", "x,y,z,w"
);

void PikaMath_Quaternion_subMethod(PikaObj *self, Args *args){
    PikaObj* quat = args_getPtr(args, "quat");
    PikaMath_Quaternion_sub(self, quat);
}
method_typedef(
    PikaMath_Quaternion_sub,
    "sub", "quat"
);

void PikaMath_Quaternion_toEulerMethod(PikaObj *self, Args *args){
    PikaObj* res = PikaMath_Quaternion_toEuler(self);
    method_returnObj(args, res);
}
method_typedef(
    PikaMath_Quaternion_toEuler,
    "toEuler", ""
);

class_def(PikaMath_Quaternion){
    __BEFORE_MOETHOD_DEF
    method_def(PikaMath_Quaternion_add, 193486030),
    method_def(PikaMath_Quaternion_dot, 193489676),
    method_def(PikaMath_Quaternion_get, 193492613),
    method_def(PikaMath_Quaternion_mul, 193499667),
    method_def(PikaMath_Quaternion_set, 193505681),
    method_def(PikaMath_Quaternion_sub, 193506191),
    method_def(PikaMath_Quaternion_inverse, 529178529),
    method_def(PikaMath_Quaternion_crossproduct, 529468080),
    method_def(PikaMath_Quaternion_magnituded, 817488071),
    method_def(PikaMath_Quaternion___init__, 904762485),
    method_def(PikaMath_Quaternion_isnormalize, 972871794),
    method_def(PikaMath_Quaternion_normalize, 1021972918),
    method_def(PikaMath_Quaternion_reverse, 1062753473),
    method_def(PikaMath_Quaternion_toEuler, 1832017573),
    method_def(PikaMath_Quaternion_fromEuler, 1961336182),
    method_def(PikaMath_Quaternion_magnitudedsquare, 2007433048),
};
class_inhert(PikaMath_Quaternion, TinyObj);

PikaObj *New_PikaMath_Quaternion(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaMath_Quaternion);
    return self;
}

Arg *PikaMath_Quaternion(PikaObj *self){
    return obj_newObjInPackage(New_PikaMath_Quaternion);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_ByteArrayMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_ByteArray(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_ByteArray,
    "ByteArray", ""
);

void PikaStdData_DictMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Dict(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Dict,
    "Dict", ""
);

void PikaStdData_FILEIOMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_FILEIO(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_FILEIO,
    "FILEIO", ""
);

void PikaStdData_ListMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_List(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_List,
    "List", ""
);

void PikaStdData_StringMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_String(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_String,
    "String", ""
);

void PikaStdData_TupleMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Tuple(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Tuple,
    "Tuple", ""
);

void PikaStdData_UtilsMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Utils(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Utils,
    "Utils", ""
);

void PikaStdData_dict_itemsMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_dict_items(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_dict_items,
    "dict_items", ""
);

void PikaStdData_dict_keysMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_dict_keys(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_dict_keys,
    "dict_keys", ""
);

class_def(PikaStdData){
    __BEFORE_MOETHOD_DEF
    constructor_def(PikaStdData_Tuple, 238099855),
    constructor_def(PikaStdData_Utils, 239242230),
    constructor_def(PikaStdData_FILEIO, 813431197),
    constructor_def(PikaStdData_dict_keys, 872966404),
    constructor_def(PikaStdData_dict_items, 888749258),
    constructor_def(PikaStdData_String, 1374591964),
    constructor_def(PikaStdData_ByteArray, 1998882840),
    constructor_def(PikaStdData_Dict, 2089035049),
    constructor_def(PikaStdData_List, 2089323073),
};
class_inhert(PikaStdData, TinyObj);

PikaObj *New_PikaStdData(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdData);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_ByteArray___getitem__Method(PikaObj *self, Args *args){
    int __key = args_getInt(args, "__key");
    int res = PikaStdData_ByteArray___getitem__(self, __key);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_ByteArray___getitem__,
    "__getitem__", "__key"
);

void PikaStdData_ByteArray___init__Method(PikaObj *self, Args *args){
    Arg* bytes = args_getArg(args, "bytes");
    PikaStdData_ByteArray___init__(self, bytes);
}
method_typedef(
    PikaStdData_ByteArray___init__,
    "__init__", "bytes"
);

void PikaStdData_ByteArray___iter__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_ByteArray___iter__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_ByteArray___iter__,
    "__iter__", ""
);

void PikaStdData_ByteArray___next__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_ByteArray___next__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_ByteArray___next__,
    "__next__", ""
);

void PikaStdData_ByteArray___setitem__Method(PikaObj *self, Args *args){
    int __key = args_getInt(args, "__key");
    int __val = args_getInt(args, "__val");
    PikaStdData_ByteArray___setitem__(self, __key, __val);
}
method_typedef(
    PikaStdData_ByteArray___setitem__,
    "__setitem__", "__key,__val"
);

void PikaStdData_ByteArray___str__Method(PikaObj *self, Args *args){
    char* res = PikaStdData_ByteArray___str__(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_ByteArray___str__,
    "__str__", ""
);

void PikaStdData_ByteArray_decodeMethod(PikaObj *self, Args *args){
    char* res = PikaStdData_ByteArray_decode(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_ByteArray_decode,
    "decode", ""
);

class_def(PikaStdData_ByteArray){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdData_ByteArray___init__, 904762485),
    method_def(PikaStdData_ByteArray___iter__, 911732085),
    method_def(PikaStdData_ByteArray___next__, 1090305216),
    method_def(PikaStdData_ByteArray___setitem__, 1364865276),
    method_def(PikaStdData_ByteArray___getitem__, 1535436016),
    method_def(PikaStdData_ByteArray_decode, 2021571977),
    method_def(PikaStdData_ByteArray___str__, 2056834106),
};
class_inhert(PikaStdData_ByteArray, TinyObj);

