QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
PikaObj *New_PikaStdData_ByteArray(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdData_ByteArray);
    return self;
}

Arg *PikaStdData_ByteArray(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdData_ByteArray);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_Dict___contains__Method(PikaObj *self, Args *args){
    Arg* val = args_getArg(args, "val");
    int res = PikaStdData_Dict___contains__(self, val);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_Dict___contains__,
    "__contains__", "val"
);

void PikaStdData_Dict___del__Method(PikaObj *self, Args *args){
    PikaStdData_Dict___del__(self);
}
method_typedef(
    PikaStdData_Dict___del__,
    "__del__", ""
);

void PikaStdData_Dict___getitem__Method(PikaObj *self, Args *args){
    Arg* __key = args_getArg(args, "__key");
    Arg* res = PikaStdData_Dict___getitem__(self, __key);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Dict___getitem__,
    "__getitem__", "__key"
);

void PikaStdData_Dict___init__Method(PikaObj *self, Args *args){
    PikaStdData_Dict___init__(self);
}
method_typedef(
    PikaStdData_Dict___init__,
    "__init__", ""
);

void PikaStdData_Dict___iter__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Dict___iter__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Dict___iter__,
    "__iter__", ""
);

void PikaStdData_Dict___len__Method(PikaObj *self, Args *args){
    int res = PikaStdData_Dict___len__(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_Dict___len__,
    "__len__", ""
);

void PikaStdData_Dict___next__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Dict___next__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Dict___next__,
    "__next__", ""
);

void PikaStdData_Dict___setitem__Method(PikaObj *self, Args *args){
    Arg* __key = args_getArg(args, "__key");
    Arg* __val = args_getArg(args, "__val");
    PikaStdData_Dict___setitem__(self, __key, __val);
}
method_typedef(
    PikaStdData_Dict___setitem__,
    "__setitem__", "__key,__val"
);

void PikaStdData_Dict___str__Method(PikaObj *self, Args *args){
    char* res = PikaStdData_Dict___str__(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_Dict___str__,
    "__str__", ""
);

void PikaStdData_Dict_getMethod(PikaObj *self, Args *args){
    char* key = args_getStr(args, "key");
    Arg* res = PikaStdData_Dict_get(self, key);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Dict_get,
    "get", "key"
);

void PikaStdData_Dict_itemsMethod(PikaObj *self, Args *args){
    PikaObj* res = PikaStdData_Dict_items(self);
    method_returnObj(args, res);
}
method_typedef(
    PikaStdData_Dict_items,
    "items", ""
);

void PikaStdData_Dict_keysMethod(PikaObj *self, Args *args){
    PikaObj* res = PikaStdData_Dict_keys(self);
    method_returnObj(args, res);
}
method_typedef(
    PikaStdData_Dict_keys,
    "keys", ""
);

void PikaStdData_Dict_removeMethod(PikaObj *self, Args *args){
    char* key = args_getStr(args, "key");
    PikaStdData_Dict_remove(self, key);
}
method_typedef(
    PikaStdData_Dict_remove,
    "remove", "key"
);

void PikaStdData_Dict_setMethod(PikaObj *self, Args *args){
    char* key = args_getStr(args, "key");
    Arg* arg = args_getArg(args, "arg");
    PikaStdData_Dict_set(self, key, arg);
}
method_typedef(
    PikaStdData_Dict_set,
    "set", "key,arg"
);

void PikaStdData_Dict_updateMethod(PikaObj *self, Args *args){
    PikaObj* other = args_getPtr(args, "other");
    PikaStdData_Dict_update(self, other);
}
method_typedef(
    PikaStdData_Dict_update,
    "update", "other"
);

class_def(PikaStdData_Dict){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdData_Dict_get, 193492613),
    method_def(PikaStdData_Dict_set, 193505681),
    method_def(PikaStdData_Dict_items, 262956327),
    method_def(PikaStdData_Dict_remove, 422343795),
    method_def(PikaStdData_Dict_update, 552456360),
    method_def(PikaStdData_Dict___init__, 904762485),
    method_def(PikaStdData_Dict___iter__, 911732085),
    method_def(PikaStdData_Dict___next__, 1090305216),
    method_def(PikaStdData_Dict___setitem__, 1364865276),
    method_def(PikaStdData_Dict___getitem__, 1535436016),
    method_def(PikaStdData_Dict___contains__, 1644201824),
    method_def(PikaStdData_Dict___del__, 2038499702),
    method_def(PikaStdData_Dict___len__, 2047989248),
    method_def(PikaStdData_Dict___str__, 2056834106),
    method_def(PikaStdData_Dict_keys, 2090432961),
};
class_inhert(PikaStdData_Dict, TinyObj);

PikaObj *New_PikaStdData_Dict(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdData_Dict);
    return self;
}

Arg *PikaStdData_Dict(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdData_Dict);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_FILEIO_closeMethod(PikaObj *self, Args *args){
    PikaStdData_FILEIO_close(self);
}
method_typedef(
    PikaStdData_FILEIO_close,
    "close", ""
);

void PikaStdData_FILEIO_initMethod(PikaObj *self, Args *args){
    char* path = args_getStr(args, "path");
    char* mode = args_getStr(args, "mode");
    int res = PikaStdData_FILEIO_init(self, path, mode);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_FILEIO_init,
    "init", "path,mode"
);

void PikaStdData_FILEIO_readMethod(PikaObj *self, Args *args){
    PikaTuple* size = args_getTuple(args, "size");
    Arg* res = PikaStdData_FILEIO_read(self, size);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_FILEIO_read,
    "read", "*size"
);

void PikaStdData_FILEIO_readlineMethod(PikaObj *self, Args *args){
    char* res = PikaStdData_FILEIO_readline(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_FILEIO_readline,
    "readline", ""
);

void PikaStdData_FILEIO_readlinesMethod(PikaObj *self, Args *args){
    PikaObj* res = PikaStdData_FILEIO_readlines(self);
    method_returnObj(args, res);
}
method_typedef(
    PikaStdData_FILEIO_readlines,
    "readlines", ""
);

void PikaStdData_FILEIO_seekMethod(PikaObj *self, Args *args){
    int offset = args_getInt(args, "offset");
    PikaTuple* fromwhere = args_getTuple(args, "fromwhere");
    int res = PikaStdData_FILEIO_seek(self, offset, fromwhere);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_FILEIO_seek,
    "seek", "offset,*fromwhere"
);

void PikaStdData_FILEIO_tellMethod(PikaObj *self, Args *args){
    int res = PikaStdData_FILEIO_tell(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_FILEIO_tell,
    "tell", ""
);

