QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
void PikaStdData_FILEIO_writeMethod(PikaObj *self, Args *args){
    Arg* s = args_getArg(args, "s");
    int res = PikaStdData_FILEIO_write(self, s);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_FILEIO_write,
    "write", "s"
);

void PikaStdData_FILEIO_writelinesMethod(PikaObj *self, Args *args){
    PikaObj* lines = args_getPtr(args, "lines");
    PikaStdData_FILEIO_writelines(self, lines);
}
method_typedef(
    PikaStdData_FILEIO_writelines,
    "writelines", "lines"
);

class_def(PikaStdData_FILEIO){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdData_FILEIO_close, 255564379),
    method_def(PikaStdData_FILEIO_write, 279491920),
    method_def(PikaStdData_FILEIO_readlines, 594708860),
    method_def(PikaStdData_FILEIO_writelines, 836522731),
    method_def(PikaStdData_FILEIO_readline, 2035354601),
    method_def(PikaStdData_FILEIO_init, 2090370361),
    method_def(PikaStdData_FILEIO_read, 2090683713),
    method_def(PikaStdData_FILEIO_seek, 2090719789),
    method_def(PikaStdData_FILEIO_tell, 2090755958),
};
class_inhert(PikaStdData_FILEIO, TinyObj);

PikaObj *New_PikaStdData_FILEIO(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdData_FILEIO);
    return self;
}

Arg *PikaStdData_FILEIO(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdData_FILEIO);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_List___add__Method(PikaObj *self, Args *args){
    PikaObj* others = args_getPtr(args, "others");
    PikaObj* res = PikaStdData_List___add__(self, others);
    method_returnObj(args, res);
}
method_typedef(
    PikaStdData_List___add__,
    "__add__", "others"
);

void PikaStdData_List___init__Method(PikaObj *self, Args *args){
    PikaStdData_List___init__(self);
}
method_typedef(
    PikaStdData_List___init__,
    "__init__", ""
);

void PikaStdData_List___setitem__Method(PikaObj *self, Args *args){
    Arg* __key = args_getArg(args, "__key");
    Arg* __val = args_getArg(args, "__val");
    PikaStdData_List___setitem__(self, __key, __val);
}
method_typedef(
    PikaStdData_List___setitem__,
    "__setitem__", "__key,__val"
);

void PikaStdData_List___str__Method(PikaObj *self, Args *args){
    char* res = PikaStdData_List___str__(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_List___str__,
    "__str__", ""
);

void PikaStdData_List_appendMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    PikaStdData_List_append(self, arg);
}
method_typedef(
    PikaStdData_List_append,
    "append", "arg"
);

void PikaStdData_List_insertMethod(PikaObj *self, Args *args){
    int i = args_getInt(args, "i");
    Arg* arg = args_getArg(args, "arg");
    PikaStdData_List_insert(self, i, arg);
}
method_typedef(
    PikaStdData_List_insert,
    "insert", "i,arg"
);

void PikaStdData_List_popMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdData_List_pop(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_List_pop,
    "pop", ""
);

void PikaStdData_List_removeMethod(PikaObj *self, Args *args){
    Arg* val = args_getArg(args, "val");
    PikaStdData_List_remove(self, val);
}
method_typedef(
    PikaStdData_List_remove,
    "remove", "val"
);

void PikaStdData_List_reverseMethod(PikaObj *self, Args *args){
    PikaStdData_List_reverse(self);
}
method_typedef(
    PikaStdData_List_reverse,
    "reverse", ""
);

void PikaStdData_List_setMethod(PikaObj *self, Args *args){
    int i = args_getInt(args, "i");
    Arg* arg = args_getArg(args, "arg");
    PikaStdData_List_set(self, i, arg);
}
method_typedef(
    PikaStdData_List_set,
    "set", "i,arg"
);

class_def(PikaStdData_List){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdData_List_insert, 81003162),
    method_def(PikaStdData_List_pop, 193502740),
    method_def(PikaStdData_List_set, 193505681),
    method_def(PikaStdData_List_remove, 422343795),
    method_def(PikaStdData_List___init__, 904762485),
    method_def(PikaStdData_List_reverse, 1062753473),
    method_def(PikaStdData_List___setitem__, 1364865276),
    method_def(PikaStdData_List_append, 1917667549),
    method_def(PikaStdData_List___add__, 2034897290),
    method_def(PikaStdData_List___str__, 2056834106),
};
class_inhert(PikaStdData_List, PikaStdData_Tuple);

PikaObj *New_PikaStdData_List(Args *args){
    PikaObj *self = New_PikaStdData_Tuple(args);
    obj_setClass(self, PikaStdData_List);
    return self;
}

Arg *PikaStdData_List(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdData_List);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_String___getitem__Method(PikaObj *self, Args *args){
    Arg* __key = args_getArg(args, "__key");
    Arg* res = PikaStdData_String___getitem__(self, __key);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_String___getitem__,
    "__getitem__", "__key"
);

void PikaStdData_String___init__Method(PikaObj *self, Args *args){
    char* s = args_getStr(args, "s");
    PikaStdData_String___init__(self, s);
}
method_typedef(
    PikaStdData_String___init__,
    "__init__", "s"
);

void PikaStdData_String___iter__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_String___iter__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_String___iter__,
    "__iter__", ""
);

void PikaStdData_String___len__Method(PikaObj *self, Args *args){
    int res = PikaStdData_String___len__(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_String___len__,
    "__len__", ""
);

void PikaStdData_String___next__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_String___next__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_String___next__,
    "__next__", ""
);

void PikaStdData_String___setitem__Method(PikaObj *self, Args *args){
    Arg* __key = args_getArg(args, "__key");
    Arg* __val = args_getArg(args, "__val");
    PikaStdData_String___setitem__(self, __key, __val);
}
method_typedef(
    PikaStdData_String___setitem__,
    "__setitem__", "__key,__val"
);

void PikaStdData_String___str__Method(PikaObj *self, Args *args){
    char* res = PikaStdData_String___str__(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_String___str__,
    "__str__", ""
);

