QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
void PikaStdData_String_encodeMethod(PikaObj *self, Args *args){
    PikaTuple* encoding = args_getTuple(args, "encoding");
    Arg* res = PikaStdData_String_encode(self, encoding);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_String_encode,
    "encode", "*encoding"
);

void PikaStdData_String_endswithMethod(PikaObj *self, Args *args){
    char* suffix = args_getStr(args, "suffix");
    int res = PikaStdData_String_endswith(self, suffix);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_String_endswith,
    "endswith", "suffix"
);

void PikaStdData_String_formatMethod(PikaObj *self, Args *args){
    PikaTuple* vars = args_getTuple(args, "vars");
    char* res = PikaStdData_String_format(self, vars);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_String_format,
    "format", "*vars"
);

void PikaStdData_String_getMethod(PikaObj *self, Args *args){
    char* res = PikaStdData_String_get(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_String_get,
    "get", ""
);

void PikaStdData_String_isalnumMethod(PikaObj *self, Args *args){
    int res = PikaStdData_String_isalnum(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_String_isalnum,
    "isalnum", ""
);

void PikaStdData_String_isalphaMethod(PikaObj *self, Args *args){
    int res = PikaStdData_String_isalpha(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_String_isalpha,
    "isalpha", ""
);

void PikaStdData_String_isdigitMethod(PikaObj *self, Args *args){
    int res = PikaStdData_String_isdigit(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_String_isdigit,
    "isdigit", ""
);

void PikaStdData_String_islowerMethod(PikaObj *self, Args *args){
    int res = PikaStdData_String_islower(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_String_islower,
    "islower", ""
);

void PikaStdData_String_isspaceMethod(PikaObj *self, Args *args){
    int res = PikaStdData_String_isspace(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_String_isspace,
    "isspace", ""
);

void PikaStdData_String_replaceMethod(PikaObj *self, Args *args){
    char* old = args_getStr(args, "old");
    char* new = args_getStr(args, "new");
    char* res = PikaStdData_String_replace(self, old, new);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_String_replace,
    "replace", "old,new"
);

void PikaStdData_String_setMethod(PikaObj *self, Args *args){
    char* s = args_getStr(args, "s");
    PikaStdData_String_set(self, s);
}
method_typedef(
    PikaStdData_String_set,
    "set", "s"
);

void PikaStdData_String_splitMethod(PikaObj *self, Args *args){
    char* s = args_getStr(args, "s");
    PikaObj* res = PikaStdData_String_split(self, s);
    method_returnObj(args, res);
}
method_typedef(
    PikaStdData_String_split,
    "split", "s"
);

void PikaStdData_String_startswithMethod(PikaObj *self, Args *args){
    char* prefix = args_getStr(args, "prefix");
    int res = PikaStdData_String_startswith(self, prefix);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_String_startswith,
    "startswith", "prefix"
);

void PikaStdData_String_stripMethod(PikaObj *self, Args *args){
    PikaTuple* chrs = args_getTuple(args, "chrs");
    char* res = PikaStdData_String_strip(self, chrs);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdData_String_strip,
    "strip", "*chrs"
);

class_def(PikaStdData_String){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdData_String_get, 193492613),
    method_def(PikaStdData_String_set, 193505681),
    method_def(PikaStdData_String_split, 274679281),
    method_def(PikaStdData_String_strip, 274829559),
    method_def(PikaStdData_String_isalnum, 700198430),
    method_def(PikaStdData_String_isalpha, 700200167),
    method_def(PikaStdData_String_isdigit, 703640370),
    method_def(PikaStdData_String_islower, 713360650),
    method_def(PikaStdData_String_isspace, 721673997),
    method_def(PikaStdData_String_startswith, 841709250),
    method_def(PikaStdData_String___init__, 904762485),
    method_def(PikaStdData_String___iter__, 911732085),
    method_def(PikaStdData_String_endswith, 920277419),
    method_def(PikaStdData_String_replace, 1055870465),
    method_def(PikaStdData_String___next__, 1090305216),
    method_def(PikaStdData_String___setitem__, 1364865276),
    method_def(PikaStdData_String___getitem__, 1535436016),
    method_def(PikaStdData_String___len__, 2047989248),
    method_def(PikaStdData_String___str__, 2056834106),
    method_def(PikaStdData_String_encode, 2071380659),
    method_def(PikaStdData_String_format, 2112238766),
};
class_inhert(PikaStdData_String, TinyObj);

PikaObj *New_PikaStdData_String(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdData_String);
    return self;
}

Arg *PikaStdData_String(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdData_String);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDATA_DISABLE
void PikaStdData_Tuple___contains__Method(PikaObj *self, Args *args){
    Arg* val = args_getArg(args, "val");
    int res = PikaStdData_Tuple___contains__(self, val);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_Tuple___contains__,
    "__contains__", "val"
);

void PikaStdData_Tuple___del__Method(PikaObj *self, Args *args){
    PikaStdData_Tuple___del__(self);
}
method_typedef(
    PikaStdData_Tuple___del__,
    "__del__", ""
);

void PikaStdData_Tuple___getitem__Method(PikaObj *self, Args *args){
    Arg* __key = args_getArg(args, "__key");
    Arg* res = PikaStdData_Tuple___getitem__(self, __key);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Tuple___getitem__,
    "__getitem__", "__key"
);

void PikaStdData_Tuple___init__Method(PikaObj *self, Args *args){
    PikaStdData_Tuple___init__(self);
}
method_typedef(
    PikaStdData_Tuple___init__,
    "__init__", ""
);

void PikaStdData_Tuple___iter__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdData_Tuple___iter__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdData_Tuple___iter__,
    "__iter__", ""
);

void PikaStdData_Tuple___len__Method(PikaObj *self, Args *args){
    int res = PikaStdData_Tuple___len__(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdData_Tuple___len__,
    "__len__", ""
);

