QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
PikaObj *New_PikaStdDevice(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdDevice);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_ADC___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_ADC___init__(self);
}
method_typedef(
    PikaStdDevice_ADC___init__,
    "__init__", ""
);

void PikaStdDevice_ADC_disableMethod(PikaObj *self, Args *args){
    PikaStdDevice_ADC_disable(self);
}
method_typedef(
    PikaStdDevice_ADC_disable,
    "disable", ""
);

void PikaStdDevice_ADC_enableMethod(PikaObj *self, Args *args){
    PikaStdDevice_ADC_enable(self);
}
method_typedef(
    PikaStdDevice_ADC_enable,
    "enable", ""
);

void PikaStdDevice_ADC_platformDisableMethod(PikaObj *self, Args *args){
    PikaStdDevice_ADC_platformDisable(self);
}
method_typedef(
    PikaStdDevice_ADC_platformDisable,
    "platformDisable", ""
);

void PikaStdDevice_ADC_platformEnableMethod(PikaObj *self, Args *args){
    PikaStdDevice_ADC_platformEnable(self);
}
method_typedef(
    PikaStdDevice_ADC_platformEnable,
    "platformEnable", ""
);

void PikaStdDevice_ADC_platformReadMethod(PikaObj *self, Args *args){
    PikaStdDevice_ADC_platformRead(self);
}
method_typedef(
    PikaStdDevice_ADC_platformRead,
    "platformRead", ""
);

void PikaStdDevice_ADC_readMethod(PikaObj *self, Args *args){
    pika_float res = PikaStdDevice_ADC_read(self);
    method_returnFloat(args, res);
}
method_typedef(
    PikaStdDevice_ADC_read,
    "read", ""
);

void PikaStdDevice_ADC_setPinMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_ADC_setPin(self, pin);
}
method_typedef(
    PikaStdDevice_ADC_setPin,
    "setPin", "pin"
);

class_def(PikaStdDevice_ADC){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_ADC_disable, 314893497),
    method_def(PikaStdDevice_ADC_platformDisable, 326843198),
    method_def(PikaStdDevice_ADC_setPin, 461696568),
    method_def(PikaStdDevice_ADC_platformEnable, 835227025),
    method_def(PikaStdDevice_ADC___init__, 904762485),
    method_def(PikaStdDevice_ADC_platformRead, 1797695974),
    method_def(PikaStdDevice_ADC_enable, 2071294892),
    method_def(PikaStdDevice_ADC_read, 2090683713),
};
class_inhert(PikaStdDevice_ADC, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_ADC(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_ADC);
    return self;
}

Arg *PikaStdDevice_ADC(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_ADC);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_BaseDev_addEventCallBackMethod(PikaObj *self, Args *args){
    Arg* eventCallback = args_getArg(args, "eventCallback");
    PikaStdDevice_BaseDev_addEventCallBack(self, eventCallback);
}
method_typedef(
    PikaStdDevice_BaseDev_addEventCallBack,
    "addEventCallBack", "eventCallback"
);

void PikaStdDevice_BaseDev_platformGetEventIdMethod(PikaObj *self, Args *args){
    PikaStdDevice_BaseDev_platformGetEventId(self);
}
method_typedef(
    PikaStdDevice_BaseDev_platformGetEventId,
    "platformGetEventId", ""
);

class_def(PikaStdDevice_BaseDev){
    __BEFORE_MOETHOD_DEF
#if PIKA_EVENT_ENABLE
    method_def(PikaStdDevice_BaseDev_platformGetEventId, 794288473),
#endif
#if PIKA_EVENT_ENABLE
    method_def(PikaStdDevice_BaseDev_addEventCallBack, 1710815869),
#endif
};
class_inhert(PikaStdDevice_BaseDev, TinyObj);

PikaObj *New_PikaStdDevice_BaseDev(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdDevice_BaseDev);
    return self;
}

Arg *PikaStdDevice_BaseDev(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_BaseDev);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_CAN___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_CAN___init__(self);
}
method_typedef(
    PikaStdDevice_CAN___init__,
    "__init__", ""
);

void PikaStdDevice_CAN_addFilterMethod(PikaObj *self, Args *args){
    int id = args_getInt(args, "id");
    int ide = args_getInt(args, "ide");
    int rtr = args_getInt(args, "rtr");
    int mode = args_getInt(args, "mode");
    int mask = args_getInt(args, "mask");
    int hdr = args_getInt(args, "hdr");
    PikaStdDevice_CAN_addFilter(self, id, ide, rtr, mode, mask, hdr);
}
method_typedef(
    PikaStdDevice_CAN_addFilter,
    "addFilter", "id,ide,rtr,mode,mask,hdr"
);

void PikaStdDevice_CAN_disableMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_disable(self);
}
method_typedef(
    PikaStdDevice_CAN_disable,
    "disable", ""
);

void PikaStdDevice_CAN_enableMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_enable(self);
}
method_typedef(
    PikaStdDevice_CAN_enable,
    "enable", ""
);

void PikaStdDevice_CAN_platformDisableMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_platformDisable(self);
}
method_typedef(
    PikaStdDevice_CAN_platformDisable,
    "platformDisable", ""
);

void PikaStdDevice_CAN_platformEnableMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_platformEnable(self);
}
method_typedef(
    PikaStdDevice_CAN_platformEnable,
    "platformEnable", ""
);

void PikaStdDevice_CAN_platformReadMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_platformRead(self);
}
method_typedef(
    PikaStdDevice_CAN_platformRead,
    "platformRead", ""
);

void PikaStdDevice_CAN_platformReadBytesMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_platformReadBytes(self);
}
method_typedef(
    PikaStdDevice_CAN_platformReadBytes,
    "platformReadBytes", ""
);

void PikaStdDevice_CAN_platformWriteMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_platformWrite(self);
}
method_typedef(
    PikaStdDevice_CAN_platformWrite,
    "platformWrite", ""
);

void PikaStdDevice_CAN_platformWriteBytesMethod(PikaObj *self, Args *args){
    PikaStdDevice_CAN_platformWriteBytes(self);
}
method_typedef(
    PikaStdDevice_CAN_platformWriteBytes,
    "platformWriteBytes", ""
);

void PikaStdDevice_CAN_readMethod(PikaObj *self, Args *args){
    int length = args_getInt(args, "length");
    char* res = PikaStdDevice_CAN_read(self, length);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdDevice_CAN_read,
    "read", "length"
);

void PikaStdDevice_CAN_readBytesMethod(PikaObj *self, Args *args){
    int length = args_getInt(args, "length");
    Arg* res = PikaStdDevice_CAN_readBytes(self, length);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_CAN_readBytes,
    "readBytes", "length"
);

