QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
void PikaStdDevice_CAN_setBaudRateMethod(PikaObj *self, Args *args){
    int baudRate = args_getInt(args, "baudRate");
    PikaStdDevice_CAN_setBaudRate(self, baudRate);
}
method_typedef(
    PikaStdDevice_CAN_setBaudRate,
    "setBaudRate", "baudRate"
);

void PikaStdDevice_CAN_setIdMethod(PikaObj *self, Args *args){
    int id = args_getInt(args, "id");
    PikaStdDevice_CAN_setId(self, id);
}
method_typedef(
    PikaStdDevice_CAN_setId,
    "setId", "id"
);

void PikaStdDevice_CAN_setModeMethod(PikaObj *self, Args *args){
    char* mode = args_getStr(args, "mode");
    PikaStdDevice_CAN_setMode(self, mode);
}
method_typedef(
    PikaStdDevice_CAN_setMode,
    "setMode", "mode"
);

void PikaStdDevice_CAN_setNameMethod(PikaObj *self, Args *args){
    char* name = args_getStr(args, "name");
    PikaStdDevice_CAN_setName(self, name);
}
method_typedef(
    PikaStdDevice_CAN_setName,
    "setName", "name"
);

void PikaStdDevice_CAN_writeMethod(PikaObj *self, Args *args){
    char* data = args_getStr(args, "data");
    PikaStdDevice_CAN_write(self, data);
}
method_typedef(
    PikaStdDevice_CAN_write,
    "write", "data"
);

void PikaStdDevice_CAN_writeBytesMethod(PikaObj *self, Args *args){
    uint8_t* data = args_getBytes(args, "data");
    int length = args_getInt(args, "length");
    PikaStdDevice_CAN_writeBytes(self, data, length);
}
method_typedef(
    PikaStdDevice_CAN_writeBytes,
    "writeBytes", "data,length"
);

class_def(PikaStdDevice_CAN){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_CAN_setMode, 203499702),
    method_def(PikaStdDevice_CAN_setName, 203520690),
    method_def(PikaStdDevice_CAN_setId, 274291614),
    method_def(PikaStdDevice_CAN_write, 279491920),
    method_def(PikaStdDevice_CAN_disable, 314893497),
    method_def(PikaStdDevice_CAN_platformDisable, 326843198),
    method_def(PikaStdDevice_CAN_addFilter, 464296980),
    method_def(PikaStdDevice_CAN_readBytes, 545481704),
    method_def(PikaStdDevice_CAN_platformReadBytes, 673804205),
    method_def(PikaStdDevice_CAN_platformWriteBytes, 726970812),
    method_def(PikaStdDevice_CAN_writeBytes, 787295575),
    method_def(PikaStdDevice_CAN_platformEnable, 835227025),
    method_def(PikaStdDevice_CAN___init__, 904762485),
    method_def(PikaStdDevice_CAN_platformWrite, 1348314773),
    method_def(PikaStdDevice_CAN_setBaudRate, 1620269241),
    method_def(PikaStdDevice_CAN_platformRead, 1797695974),
    method_def(PikaStdDevice_CAN_enable, 2071294892),
    method_def(PikaStdDevice_CAN_read, 2090683713),
};
class_inhert(PikaStdDevice_CAN, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_CAN(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_CAN);
    return self;
}

Arg *PikaStdDevice_CAN(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_CAN);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_GPIO___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_GPIO___init__(self);
}
method_typedef(
    PikaStdDevice_GPIO___init__,
    "__init__", ""
);

void PikaStdDevice_GPIO_disableMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_disable(self);
}
method_typedef(
    PikaStdDevice_GPIO_disable,
    "disable", ""
);

void PikaStdDevice_GPIO_enableMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_enable(self);
}
method_typedef(
    PikaStdDevice_GPIO_enable,
    "enable", ""
);

void PikaStdDevice_GPIO_getIdMethod(PikaObj *self, Args *args){
    int res = PikaStdDevice_GPIO_getId(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdDevice_GPIO_getId,
    "getId", ""
);

void PikaStdDevice_GPIO_getModeMethod(PikaObj *self, Args *args){
    char* res = PikaStdDevice_GPIO_getMode(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdDevice_GPIO_getMode,
    "getMode", ""
);

void PikaStdDevice_GPIO_getPinMethod(PikaObj *self, Args *args){
    char* res = PikaStdDevice_GPIO_getPin(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdDevice_GPIO_getPin,
    "getPin", ""
);

void PikaStdDevice_GPIO_highMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_high(self);
}
method_typedef(
    PikaStdDevice_GPIO_high,
    "high", ""
);

void PikaStdDevice_GPIO_lowMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_low(self);
}
method_typedef(
    PikaStdDevice_GPIO_low,
    "low", ""
);

void PikaStdDevice_GPIO_platformDisableMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_platformDisable(self);
}
method_typedef(
    PikaStdDevice_GPIO_platformDisable,
    "platformDisable", ""
);

void PikaStdDevice_GPIO_platformEnableMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_platformEnable(self);
}
method_typedef(
    PikaStdDevice_GPIO_platformEnable,
    "platformEnable", ""
);

void PikaStdDevice_GPIO_platformHighMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_platformHigh(self);
}
method_typedef(
    PikaStdDevice_GPIO_platformHigh,
    "platformHigh", ""
);

void PikaStdDevice_GPIO_platformLowMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_platformLow(self);
}
method_typedef(
    PikaStdDevice_GPIO_platformLow,
    "platformLow", ""
);

void PikaStdDevice_GPIO_platformReadMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_platformRead(self);
}
method_typedef(
    PikaStdDevice_GPIO_platformRead,
    "platformRead", ""
);

void PikaStdDevice_GPIO_platformSetModeMethod(PikaObj *self, Args *args){
    PikaStdDevice_GPIO_platformSetMode(self);
}
method_typedef(
    PikaStdDevice_GPIO_platformSetMode,
    "platformSetMode", ""
);

void PikaStdDevice_GPIO_readMethod(PikaObj *self, Args *args){
    int res = PikaStdDevice_GPIO_read(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdDevice_GPIO_read,
    "read", ""
);

void PikaStdDevice_GPIO_setIdMethod(PikaObj *self, Args *args){
    int id = args_getInt(args, "id");
    PikaStdDevice_GPIO_setId(self, id);
}
method_typedef(
    PikaStdDevice_GPIO_setId,
    "setId", "id"
);

void PikaStdDevice_GPIO_setModeMethod(PikaObj *self, Args *args){
    char* mode = args_getStr(args, "mode");
    PikaStdDevice_GPIO_setMode(self, mode);
}
method_typedef(
    PikaStdDevice_GPIO_setMode,
    "setMode", "mode"
);

void PikaStdDevice_GPIO_setPinMethod(PikaObj *self, Args *args){
    char* pinName = args_getStr(args, "pinName");
    PikaStdDevice_GPIO_setPin(self, pinName);
}
method_typedef(
    PikaStdDevice_GPIO_setPin,
    "setPin", "pinName"
);

void PikaStdDevice_GPIO_setPullMethod(PikaObj *self, Args *args){
    char* pull = args_getStr(args, "pull");
    PikaStdDevice_GPIO_setPull(self, pull);
}
method_typedef(
    PikaStdDevice_GPIO_setPull,
    "setPull", "pull"
);

class_def(PikaStdDevice_GPIO){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_GPIO_low, 193498391),
    method_def(PikaStdDevice_GPIO_setMode, 203499702),
    method_def(PikaStdDevice_GPIO_setPull, 203614318),
    method_def(PikaStdDevice_GPIO_platformSetMode, 215449403),
    method_def(PikaStdDevice_GPIO_getId, 260060562),
    method_def(PikaStdDevice_GPIO_setId, 274291614),
    method_def(PikaStdDevice_GPIO_disable, 314893497),
    method_def(PikaStdDevice_GPIO_platformDisable, 326843198),
    method_def(PikaStdDevice_GPIO_setPin, 461696568),
    method_def(PikaStdDevice_GPIO_platformEnable, 835227025),
    method_def(PikaStdDevice_GPIO___init__, 904762485),
    method_def(PikaStdDevice_GPIO_platformLow, 1616275740),
    method_def(PikaStdDevice_GPIO_platformHigh, 1797341162),
    method_def(PikaStdDevice_GPIO_platformRead, 1797695974),
    method_def(PikaStdDevice_GPIO_getMode, 1885753258),
    method_def(PikaStdDevice_GPIO_enable, 2071294892),
    method_def(PikaStdDevice_GPIO_high, 2090328901),
    method_def(PikaStdDevice_GPIO_read, 2090683713),
    method_def(PikaStdDevice_GPIO_getPin, 2139555500),
};
class_inhert(PikaStdDevice_GPIO, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_GPIO(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_GPIO);
    return self;
}

