QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
Arg *PikaStdDevice_GPIO(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_GPIO);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_IIC___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_IIC___init__(self);
}
method_typedef(
    PikaStdDevice_IIC___init__,
    "__init__", ""
);

void PikaStdDevice_IIC_disableMethod(PikaObj *self, Args *args){
    PikaStdDevice_IIC_disable(self);
}
method_typedef(
    PikaStdDevice_IIC_disable,
    "disable", ""
);

void PikaStdDevice_IIC_enableMethod(PikaObj *self, Args *args){
    PikaStdDevice_IIC_enable(self);
}
method_typedef(
    PikaStdDevice_IIC_enable,
    "enable", ""
);

void PikaStdDevice_IIC_platformDisableMethod(PikaObj *self, Args *args){
    PikaStdDevice_IIC_platformDisable(self);
}
method_typedef(
    PikaStdDevice_IIC_platformDisable,
    "platformDisable", ""
);

void PikaStdDevice_IIC_platformEnableMethod(PikaObj *self, Args *args){
    PikaStdDevice_IIC_platformEnable(self);
}
method_typedef(
    PikaStdDevice_IIC_platformEnable,
    "platformEnable", ""
);

void PikaStdDevice_IIC_platformReadMethod(PikaObj *self, Args *args){
    PikaStdDevice_IIC_platformRead(self);
}
method_typedef(
    PikaStdDevice_IIC_platformRead,
    "platformRead", ""
);

void PikaStdDevice_IIC_platformReadBytesMethod(PikaObj *self, Args *args){
    PikaStdDevice_IIC_platformReadBytes(self);
}
method_typedef(
    PikaStdDevice_IIC_platformReadBytes,
    "platformReadBytes", ""
);

void PikaStdDevice_IIC_platformWriteMethod(PikaObj *self, Args *args){
    PikaStdDevice_IIC_platformWrite(self);
}
method_typedef(
    PikaStdDevice_IIC_platformWrite,
    "platformWrite", ""
);

void PikaStdDevice_IIC_platformWriteBytesMethod(PikaObj *self, Args *args){
    PikaStdDevice_IIC_platformWriteBytes(self);
}
method_typedef(
    PikaStdDevice_IIC_platformWriteBytes,
    "platformWriteBytes", ""
);

void PikaStdDevice_IIC_readMethod(PikaObj *self, Args *args){
    int addr = args_getInt(args, "addr");
    int length = args_getInt(args, "length");
    char* res = PikaStdDevice_IIC_read(self, addr, length);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdDevice_IIC_read,
    "read", "addr,length"
);

void PikaStdDevice_IIC_readBytesMethod(PikaObj *self, Args *args){
    int addr = args_getInt(args, "addr");
    int length = args_getInt(args, "length");
    Arg* res = PikaStdDevice_IIC_readBytes(self, addr, length);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_IIC_readBytes,
    "readBytes", "addr,length"
);

void PikaStdDevice_IIC_setDeviceAddrMethod(PikaObj *self, Args *args){
    int addr = args_getInt(args, "addr");
    PikaStdDevice_IIC_setDeviceAddr(self, addr);
}
method_typedef(
    PikaStdDevice_IIC_setDeviceAddr,
    "setDeviceAddr", "addr"
);

void PikaStdDevice_IIC_setPinSCLMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_IIC_setPinSCL(self, pin);
}
method_typedef(
    PikaStdDevice_IIC_setPinSCL,
    "setPinSCL", "pin"
);

void PikaStdDevice_IIC_setPinSDAMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_IIC_setPinSDA(self, pin);
}
method_typedef(
    PikaStdDevice_IIC_setPinSDA,
    "setPinSDA", "pin"
);

void PikaStdDevice_IIC_writeMethod(PikaObj *self, Args *args){
    int addr = args_getInt(args, "addr");
    char* data = args_getStr(args, "data");
    PikaStdDevice_IIC_write(self, addr, data);
}
method_typedef(
    PikaStdDevice_IIC_write,
    "write", "addr,data"
);

void PikaStdDevice_IIC_writeBytesMethod(PikaObj *self, Args *args){
    int addr = args_getInt(args, "addr");
    uint8_t* data = args_getBytes(args, "data");
    int length = args_getInt(args, "length");
    PikaStdDevice_IIC_writeBytes(self, addr, data, length);
}
method_typedef(
    PikaStdDevice_IIC_writeBytes,
    "writeBytes", "addr,data,length"
);

class_def(PikaStdDevice_IIC){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_IIC_write, 279491920),
    method_def(PikaStdDevice_IIC_disable, 314893497),
    method_def(PikaStdDevice_IIC_platformDisable, 326843198),
    method_def(PikaStdDevice_IIC_setPinSCL, 530992442),
    method_def(PikaStdDevice_IIC_setPinSDA, 530992464),
    method_def(PikaStdDevice_IIC_readBytes, 545481704),
    method_def(PikaStdDevice_IIC_platformReadBytes, 673804205),
    method_def(PikaStdDevice_IIC_platformWriteBytes, 726970812),
    method_def(PikaStdDevice_IIC_writeBytes, 787295575),
    method_def(PikaStdDevice_IIC_platformEnable, 835227025),
    method_def(PikaStdDevice_IIC___init__, 904762485),
    method_def(PikaStdDevice_IIC_setDeviceAddr, 1103920220),
    method_def(PikaStdDevice_IIC_platformWrite, 1348314773),
    method_def(PikaStdDevice_IIC_platformRead, 1797695974),
    method_def(PikaStdDevice_IIC_enable, 2071294892),
    method_def(PikaStdDevice_IIC_read, 2090683713),
};
class_inhert(PikaStdDevice_IIC, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_IIC(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_IIC);
    return self;
}

Arg *PikaStdDevice_IIC(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_IIC);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_PWM___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_PWM___init__(self);
}
method_typedef(
    PikaStdDevice_PWM___init__,
    "__init__", ""
);

void PikaStdDevice_PWM_disableMethod(PikaObj *self, Args *args){
    PikaStdDevice_PWM_disable(self);
}
method_typedef(
    PikaStdDevice_PWM_disable,
    "disable", ""
);

void PikaStdDevice_PWM_enableMethod(PikaObj *self, Args *args){
    PikaStdDevice_PWM_enable(self);
}
method_typedef(
    PikaStdDevice_PWM_enable,
    "enable", ""
);

void PikaStdDevice_PWM_getChannelMethod(PikaObj *self, Args *args){
    int res = PikaStdDevice_PWM_getChannel(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdDevice_PWM_getChannel,
    "getChannel", ""
);

void PikaStdDevice_PWM_getDutyMethod(PikaObj *self, Args *args){
    pika_float res = PikaStdDevice_PWM_getDuty(self);
    method_returnFloat(args, res);
}
method_typedef(
    PikaStdDevice_PWM_getDuty,
    "getDuty", ""
);

void PikaStdDevice_PWM_getFrequencyMethod(PikaObj *self, Args *args){
    int res = PikaStdDevice_PWM_getFrequency(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdDevice_PWM_getFrequency,
    "getFrequency", ""
);

void PikaStdDevice_PWM_getNameMethod(PikaObj *self, Args *args){
    char* res = PikaStdDevice_PWM_getName(self);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdDevice_PWM_getName,
    "getName", ""
);

