QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
void PikaStdDevice_SPI_setPinMISOMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_SPI_setPinMISO(self, pin);
}
method_typedef(
    PikaStdDevice_SPI_setPinMISO,
    "setPinMISO", "pin"
);

void PikaStdDevice_SPI_setPinMOSIMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_SPI_setPinMOSI(self, pin);
}
method_typedef(
    PikaStdDevice_SPI_setPinMOSI,
    "setPinMOSI", "pin"
);

void PikaStdDevice_SPI_setPinSCKMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    PikaStdDevice_SPI_setPinSCK(self, pin);
}
method_typedef(
    PikaStdDevice_SPI_setPinSCK,
    "setPinSCK", "pin"
);

void PikaStdDevice_SPI_setPolarityMethod(PikaObj *self, Args *args){
    int polarity = args_getInt(args, "polarity");
    PikaStdDevice_SPI_setPolarity(self, polarity);
}
method_typedef(
    PikaStdDevice_SPI_setPolarity,
    "setPolarity", "polarity"
);

void PikaStdDevice_SPI_writeMethod(PikaObj *self, Args *args){
    char* data = args_getStr(args, "data");
    PikaStdDevice_SPI_write(self, data);
}
method_typedef(
    PikaStdDevice_SPI_write,
    "write", "data"
);

void PikaStdDevice_SPI_writeBytesMethod(PikaObj *self, Args *args){
    uint8_t* data = args_getBytes(args, "data");
    int length = args_getInt(args, "length");
    PikaStdDevice_SPI_writeBytes(self, data, length);
}
method_typedef(
    PikaStdDevice_SPI_writeBytes,
    "writeBytes", "data,length"
);

class_def(PikaStdDevice_SPI){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_SPI_setName, 203520690),
    method_def(PikaStdDevice_SPI_setId, 274291614),
    method_def(PikaStdDevice_SPI_setPhase, 276342722),
    method_def(PikaStdDevice_SPI_write, 279491920),
    method_def(PikaStdDevice_SPI_disable, 314893497),
    method_def(PikaStdDevice_SPI_platformDisable, 326843198),
    method_def(PikaStdDevice_SPI_setPinMISO, 342672624),
    method_def(PikaStdDevice_SPI_setPinMOSI, 342679152),
    method_def(PikaStdDevice_SPI_setPinSCK, 530992441),
    method_def(PikaStdDevice_SPI_readBytes, 545481704),
    method_def(PikaStdDevice_SPI_platformReadBytes, 673804205),
    method_def(PikaStdDevice_SPI_platformWriteBytes, 726970812),
    method_def(PikaStdDevice_SPI_writeBytes, 787295575),
    method_def(PikaStdDevice_SPI_platformEnable, 835227025),
    method_def(PikaStdDevice_SPI___init__, 904762485),
    method_def(PikaStdDevice_SPI_platformWrite, 1348314773),
    method_def(PikaStdDevice_SPI_setBaudRate, 1620269241),
    method_def(PikaStdDevice_SPI_platformRead, 1797695974),
    method_def(PikaStdDevice_SPI_setPolarity, 1824081573),
    method_def(PikaStdDevice_SPI_enable, 2071294892),
    method_def(PikaStdDevice_SPI_read, 2090683713),
};
class_inhert(PikaStdDevice_SPI, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_SPI(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_SPI);
    return self;
}

Arg *PikaStdDevice_SPI(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_SPI);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_Time___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_Time___init__(self);
}
method_typedef(
    PikaStdDevice_Time___init__,
    "__init__", ""
);

void PikaStdDevice_Time_asctimeMethod(PikaObj *self, Args *args){
    PikaStdDevice_Time_asctime(self);
}
method_typedef(
    PikaStdDevice_Time_asctime,
    "asctime", ""
);

void PikaStdDevice_Time_ctimeMethod(PikaObj *self, Args *args){
    pika_float unix_time = args_getFloat(args, "unix_time");
    PikaStdDevice_Time_ctime(self, unix_time);
}
method_typedef(
    PikaStdDevice_Time_ctime,
    "ctime", "unix_time"
);

void PikaStdDevice_Time_gmtimeMethod(PikaObj *self, Args *args){
    pika_float unix_time = args_getFloat(args, "unix_time");
    PikaStdDevice_Time_gmtime(self, unix_time);
}
method_typedef(
    PikaStdDevice_Time_gmtime,
    "gmtime", "unix_time"
);

void PikaStdDevice_Time_localtimeMethod(PikaObj *self, Args *args){
    pika_float unix_time = args_getFloat(args, "unix_time");
    PikaStdDevice_Time_localtime(self, unix_time);
}
method_typedef(
    PikaStdDevice_Time_localtime,
    "localtime", "unix_time"
);

void PikaStdDevice_Time_mktimeMethod(PikaObj *self, Args *args){
    int res = PikaStdDevice_Time_mktime(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdDevice_Time_mktime,
    "mktime", ""
);

void PikaStdDevice_Time_platformGetTickMethod(PikaObj *self, Args *args){
    PikaStdDevice_Time_platformGetTick(self);
}
method_typedef(
    PikaStdDevice_Time_platformGetTick,
    "platformGetTick", ""
);

void PikaStdDevice_Time_sleepMethod(PikaObj *self, Args *args){
    pika_float s = args_getFloat(args, "s");
    PikaStdDevice_Time_sleep(self, s);
}
method_typedef(
    PikaStdDevice_Time_sleep,
    "sleep", "s"
);

void PikaStdDevice_Time_sleep_msMethod(PikaObj *self, Args *args){
    int ms = args_getInt(args, "ms");
    PikaStdDevice_Time_sleep_ms(self, ms);
}
method_typedef(
    PikaStdDevice_Time_sleep_ms,
    "sleep_ms", "ms"
);

void PikaStdDevice_Time_sleep_sMethod(PikaObj *self, Args *args){
    int s = args_getInt(args, "s");
    PikaStdDevice_Time_sleep_s(self, s);
}
method_typedef(
    PikaStdDevice_Time_sleep_s,
    "sleep_s", "s"
);

void PikaStdDevice_Time_timeMethod(PikaObj *self, Args *args){
    pika_float res = PikaStdDevice_Time_time(self);
    method_returnFloat(args, res);
}
method_typedef(
    PikaStdDevice_Time_time,
    "time", ""
);

void PikaStdDevice_Time_time_nsMethod(PikaObj *self, Args *args){
    int res = PikaStdDevice_Time_time_ns(self);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdDevice_Time_time_ns,
    "time_ns", ""
);

class_def(PikaStdDevice_Time){
    __BEFORE_MOETHOD_DEF
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(PikaStdDevice_Time_gmtime, 1586568),
#endif
    method_def(PikaStdDevice_Time_sleep_ms, 164842493),
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(PikaStdDevice_Time_mktime, 234027084),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(PikaStdDevice_Time_ctime, 255845143),
#endif
    method_def(PikaStdDevice_Time_sleep, 274527774),
    method_def(PikaStdDevice_Time_sleep_s, 460522064),
    method_def(PikaStdDevice_Time___init__, 904762485),
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(PikaStdDevice_Time_localtime, 907356095),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(PikaStdDevice_Time_asctime, 1108526539),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(PikaStdDevice_Time_time_ns, 1644053204),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(PikaStdDevice_Time_platformGetTick, 1897947957),
#endif
#if PIKA_STD_DEVICE_UNIX_TIME_ENABLE
    method_def(PikaStdDevice_Time_time, 2090760340),
#endif
};
