QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
class_inhert(PikaStdDevice_Time, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_Time(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_Time);
    return self;
}

Arg *PikaStdDevice_Time(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_Time);
}
#endif

#ifndef PIKA_MODULE_PIKASTDDEVICE_DISABLE
void PikaStdDevice_UART___init__Method(PikaObj *self, Args *args){
    PikaStdDevice_UART___init__(self);
}
method_typedef(
    PikaStdDevice_UART___init__,
    "__init__", ""
);

void PikaStdDevice_UART_disableMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_disable(self);
}
method_typedef(
    PikaStdDevice_UART_disable,
    "disable", ""
);

void PikaStdDevice_UART_enableMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_enable(self);
}
method_typedef(
    PikaStdDevice_UART_enable,
    "enable", ""
);

void PikaStdDevice_UART_platformDisableMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_platformDisable(self);
}
method_typedef(
    PikaStdDevice_UART_platformDisable,
    "platformDisable", ""
);

void PikaStdDevice_UART_platformEnableMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_platformEnable(self);
}
method_typedef(
    PikaStdDevice_UART_platformEnable,
    "platformEnable", ""
);

void PikaStdDevice_UART_platformReadMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_platformRead(self);
}
method_typedef(
    PikaStdDevice_UART_platformRead,
    "platformRead", ""
);

void PikaStdDevice_UART_platformReadBytesMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_platformReadBytes(self);
}
method_typedef(
    PikaStdDevice_UART_platformReadBytes,
    "platformReadBytes", ""
);

void PikaStdDevice_UART_platformWriteMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_platformWrite(self);
}
method_typedef(
    PikaStdDevice_UART_platformWrite,
    "platformWrite", ""
);

void PikaStdDevice_UART_platformWriteBytesMethod(PikaObj *self, Args *args){
    PikaStdDevice_UART_platformWriteBytes(self);
}
method_typedef(
    PikaStdDevice_UART_platformWriteBytes,
    "platformWriteBytes", ""
);

void PikaStdDevice_UART_readMethod(PikaObj *self, Args *args){
    int length = args_getInt(args, "length");
    char* res = PikaStdDevice_UART_read(self, length);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdDevice_UART_read,
    "read", "length"
);

void PikaStdDevice_UART_readBytesMethod(PikaObj *self, Args *args){
    int length = args_getInt(args, "length");
    Arg* res = PikaStdDevice_UART_readBytes(self, length);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdDevice_UART_readBytes,
    "readBytes", "length"
);

void PikaStdDevice_UART_setBaudRateMethod(PikaObj *self, Args *args){
    int baudRate = args_getInt(args, "baudRate");
    PikaStdDevice_UART_setBaudRate(self, baudRate);
}
method_typedef(
    PikaStdDevice_UART_setBaudRate,
    "setBaudRate", "baudRate"
);

void PikaStdDevice_UART_setIdMethod(PikaObj *self, Args *args){
    int id = args_getInt(args, "id");
    PikaStdDevice_UART_setId(self, id);
}
method_typedef(
    PikaStdDevice_UART_setId,
    "setId", "id"
);

void PikaStdDevice_UART_writeMethod(PikaObj *self, Args *args){
    char* data = args_getStr(args, "data");
    PikaStdDevice_UART_write(self, data);
}
method_typedef(
    PikaStdDevice_UART_write,
    "write", "data"
);

void PikaStdDevice_UART_writeBytesMethod(PikaObj *self, Args *args){
    uint8_t* data = args_getBytes(args, "data");
    int length = args_getInt(args, "length");
    PikaStdDevice_UART_writeBytes(self, data, length);
}
method_typedef(
    PikaStdDevice_UART_writeBytes,
    "writeBytes", "data,length"
);

class_def(PikaStdDevice_UART){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdDevice_UART_setId, 274291614),
    method_def(PikaStdDevice_UART_write, 279491920),
    method_def(PikaStdDevice_UART_disable, 314893497),
    method_def(PikaStdDevice_UART_platformDisable, 326843198),
    method_def(PikaStdDevice_UART_readBytes, 545481704),
    method_def(PikaStdDevice_UART_platformReadBytes, 673804205),
    method_def(PikaStdDevice_UART_platformWriteBytes, 726970812),
    method_def(PikaStdDevice_UART_writeBytes, 787295575),
    method_def(PikaStdDevice_UART_platformEnable, 835227025),
    method_def(PikaStdDevice_UART___init__, 904762485),
    method_def(PikaStdDevice_UART_platformWrite, 1348314773),
    method_def(PikaStdDevice_UART_setBaudRate, 1620269241),
    method_def(PikaStdDevice_UART_platformRead, 1797695974),
    method_def(PikaStdDevice_UART_enable, 2071294892),
    method_def(PikaStdDevice_UART_read, 2090683713),
};
class_inhert(PikaStdDevice_UART, PikaStdDevice_BaseDev);

PikaObj *New_PikaStdDevice_UART(Args *args){
    PikaObj *self = New_PikaStdDevice_BaseDev(args);
    obj_setClass(self, PikaStdDevice_UART);
    return self;
}

Arg *PikaStdDevice_UART(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdDevice_UART);
}
#endif

#ifndef PIKA_MODULE_PIKASTDLIB_DISABLE
void PikaStdLib_MemCheckerMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdLib_MemChecker(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_MemChecker,
    "MemChecker", ""
);

void PikaStdLib_RangeObjMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdLib_RangeObj(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_RangeObj,
    "RangeObj", ""
);

void PikaStdLib_StringObjMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdLib_StringObj(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_StringObj,
    "StringObj", ""
);

void PikaStdLib_SysObjMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdLib_SysObj(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_SysObj,
    "SysObj", ""
);

class_def(PikaStdLib){
    __BEFORE_MOETHOD_DEF
#if 0
    constructor_def(PikaStdLib_StringObj, 145144695),
#endif
    constructor_def(PikaStdLib_MemChecker, 426635353),
    constructor_def(PikaStdLib_SysObj, 1380528799),
#if 0
    constructor_def(PikaStdLib_RangeObj, 1538428845),
#endif
};
class_inhert(PikaStdLib, TinyObj);

PikaObj *New_PikaStdLib(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdLib);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKASTDLIB_DISABLE
void PikaStdLib_MemChecker_getMaxMethod(PikaObj *self, Args *args){
    pika_float res = PikaStdLib_MemChecker_getMax(self);
    method_returnFloat(args, res);
}
method_typedef(
    PikaStdLib_MemChecker_getMax,
    "getMax", ""
);

void PikaStdLib_MemChecker_getNowMethod(PikaObj *self, Args *args){
    pika_float res = PikaStdLib_MemChecker_getNow(self);
    method_returnFloat(args, res);
}
method_typedef(
    PikaStdLib_MemChecker_getNow,
    "getNow", ""
);

