QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
void PikaStdLib_MemChecker_maxMethod(PikaObj *self, Args *args){
    PikaStdLib_MemChecker_max(self);
}
method_typedef(
    PikaStdLib_MemChecker_max,
    "max", ""
);

void PikaStdLib_MemChecker_nowMethod(PikaObj *self, Args *args){
    PikaStdLib_MemChecker_now(self);
}
method_typedef(
    PikaStdLib_MemChecker_now,
    "now", ""
);

void PikaStdLib_MemChecker_resetMaxMethod(PikaObj *self, Args *args){
    PikaStdLib_MemChecker_resetMax(self);
}
method_typedef(
    PikaStdLib_MemChecker_resetMax,
    "resetMax", ""
);

class_def(PikaStdLib_MemChecker){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdLib_MemChecker_max, 193499019),
    method_def(PikaStdLib_MemChecker_now, 193500569),
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_MemChecker_resetMax, 593750542),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_MemChecker_getMax, 2139551979),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_MemChecker_getNow, 2139553529),
#endif
};
class_inhert(PikaStdLib_MemChecker, TinyObj);

PikaObj *New_PikaStdLib_MemChecker(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdLib_MemChecker);
    return self;
}

Arg *PikaStdLib_MemChecker(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdLib_MemChecker);
}
#endif

#ifndef PIKA_MODULE_PIKASTDLIB_DISABLE
void PikaStdLib_RangeObj___next__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdLib_RangeObj___next__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_RangeObj___next__,
    "__next__", ""
);

class_def(PikaStdLib_RangeObj){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdLib_RangeObj___next__, 1090305216),
};
class_inhert(PikaStdLib_RangeObj, TinyObj);

PikaObj *New_PikaStdLib_RangeObj(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdLib_RangeObj);
    return self;
}

Arg *PikaStdLib_RangeObj(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdLib_RangeObj);
}
#endif

#ifndef PIKA_MODULE_PIKASTDLIB_DISABLE
void PikaStdLib_StringObj___next__Method(PikaObj *self, Args *args){
    Arg* res = PikaStdLib_StringObj___next__(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_StringObj___next__,
    "__next__", ""
);

class_def(PikaStdLib_StringObj){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdLib_StringObj___next__, 1090305216),
};
class_inhert(PikaStdLib_StringObj, TinyObj);

PikaObj *New_PikaStdLib_StringObj(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdLib_StringObj);
    return self;
}

Arg *PikaStdLib_StringObj(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdLib_StringObj);
}
#endif

#ifndef PIKA_MODULE_PIKASTDLIB_DISABLE
void PikaStdLib_SysObj___getitem__Method(PikaObj *self, Args *args){
    Arg* obj = args_getArg(args, "obj");
    Arg* key = args_getArg(args, "key");
    Arg* res = PikaStdLib_SysObj___getitem__(self, obj, key);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_SysObj___getitem__,
    "__getitem__", "obj,key"
);

void PikaStdLib_SysObj___setitem__Method(PikaObj *self, Args *args){
    Arg* obj = args_getArg(args, "obj");
    Arg* key = args_getArg(args, "key");
    Arg* val = args_getArg(args, "val");
    Arg* res = PikaStdLib_SysObj___setitem__(self, obj, key, val);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_SysObj___setitem__,
    "__setitem__", "obj,key,val"
);

void PikaStdLib_SysObj_bytesMethod(PikaObj *self, Args *args){
    Arg* val = args_getArg(args, "val");
    Arg* res = PikaStdLib_SysObj_bytes(self, val);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_SysObj_bytes,
    "bytes", "val"
);

void PikaStdLib_SysObj_cformatMethod(PikaObj *self, Args *args){
    char* fmt = args_getStr(args, "fmt");
    PikaTuple* var = args_getTuple(args, "var");
    char* res = PikaStdLib_SysObj_cformat(self, fmt, var);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdLib_SysObj_cformat,
    "cformat", "fmt,*var"
);

void PikaStdLib_SysObj_chrMethod(PikaObj *self, Args *args){
    int val = args_getInt(args, "val");
    char* res = PikaStdLib_SysObj_chr(self, val);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdLib_SysObj_chr,
    "chr", "val"
);

void PikaStdLib_SysObj_dictMethod(PikaObj *self, Args *args){
    PikaTuple* val = args_getTuple(args, "val");
    Arg* res = PikaStdLib_SysObj_dict(self, val);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_SysObj_dict,
    "dict", "*val"
);

void PikaStdLib_SysObj_dirMethod(PikaObj *self, Args *args){
    PikaObj* obj = args_getPtr(args, "obj");
    PikaObj* res = PikaStdLib_SysObj_dir(self, obj);
    method_returnObj(args, res);
}
method_typedef(
    PikaStdLib_SysObj_dir,
    "dir", "obj"
);

void PikaStdLib_SysObj_evalMethod(PikaObj *self, Args *args){
    char* code = args_getStr(args, "code");
    Arg* res = PikaStdLib_SysObj_eval(self, code);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_SysObj_eval,
    "eval", "code"
);

void PikaStdLib_SysObj_execMethod(PikaObj *self, Args *args){
    char* code = args_getStr(args, "code");
    PikaStdLib_SysObj_exec(self, code);
}
method_typedef(
    PikaStdLib_SysObj_exec,
    "exec", "code"
);

void PikaStdLib_SysObj_exitMethod(PikaObj *self, Args *args){
    PikaStdLib_SysObj_exit(self);
}
method_typedef(
    PikaStdLib_SysObj_exit,
    "exit", ""
);

void PikaStdLib_SysObj_floatMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    pika_float res = PikaStdLib_SysObj_float(self, arg);
    method_returnFloat(args, res);
}
method_typedef(
    PikaStdLib_SysObj_float,
    "float", "arg"
);

void PikaStdLib_SysObj_getattrMethod(PikaObj *self, Args *args){
    PikaObj* obj = args_getPtr(args, "obj");
    char* name = args_getStr(args, "name");
    Arg* res = PikaStdLib_SysObj_getattr(self, obj, name);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_SysObj_getattr,
    "getattr", "obj,name"
);

void PikaStdLib_SysObj_hasattrMethod(PikaObj *self, Args *args){
    PikaObj* obj = args_getPtr(args, "obj");
    char* name = args_getStr(args, "name");
    int res = PikaStdLib_SysObj_hasattr(self, obj, name);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdLib_SysObj_hasattr,
    "hasattr", "obj,name"
);

void PikaStdLib_SysObj_helpMethod(PikaObj *self, Args *args){
    char* name = args_getStr(args, "name");
    PikaStdLib_SysObj_help(self, name);
}
method_typedef(
    PikaStdLib_SysObj_help,
    "help", "name"
);

