QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
void PikaStdLib_SysObj_hexMethod(PikaObj *self, Args *args){
    int val = args_getInt(args, "val");
    char* res = PikaStdLib_SysObj_hex(self, val);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdLib_SysObj_hex,
    "hex", "val"
);

void PikaStdLib_SysObj_idMethod(PikaObj *self, Args *args){
    Arg* obj = args_getArg(args, "obj");
    int res = PikaStdLib_SysObj_id(self, obj);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdLib_SysObj_id,
    "id", "obj"
);

void PikaStdLib_SysObj_inputMethod(PikaObj *self, Args *args){
    PikaTuple* info = args_getTuple(args, "info");
    char* res = PikaStdLib_SysObj_input(self, info);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdLib_SysObj_input,
    "input", "*info"
);

void PikaStdLib_SysObj_intMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    int res = PikaStdLib_SysObj_int(self, arg);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdLib_SysObj_int,
    "int", "arg"
);

void PikaStdLib_SysObj_iterMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    Arg* res = PikaStdLib_SysObj_iter(self, arg);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_SysObj_iter,
    "iter", "arg"
);

void PikaStdLib_SysObj_lenMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    int res = PikaStdLib_SysObj_len(self, arg);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdLib_SysObj_len,
    "len", "arg"
);

void PikaStdLib_SysObj_listMethod(PikaObj *self, Args *args){
    PikaTuple* val = args_getTuple(args, "val");
    Arg* res = PikaStdLib_SysObj_list(self, val);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_SysObj_list,
    "list", "*val"
);

void PikaStdLib_SysObj_openMethod(PikaObj *self, Args *args){
    char* path = args_getStr(args, "path");
    char* mode = args_getStr(args, "mode");
    PikaObj* res = PikaStdLib_SysObj_open(self, path, mode);
    method_returnObj(args, res);
}
method_typedef(
    PikaStdLib_SysObj_open,
    "open", "path,mode"
);

void PikaStdLib_SysObj_ordMethod(PikaObj *self, Args *args){
    char* val = args_getStr(args, "val");
    int res = PikaStdLib_SysObj_ord(self, val);
    method_returnInt(args, res);
}
method_typedef(
    PikaStdLib_SysObj_ord,
    "ord", "val"
);

void PikaStdLib_SysObj_printMethod(PikaObj *self, Args *args){
    PikaTuple* val = args_getTuple(args, "val");
    PikaDict* ops = args_getDict(args, "ops");
    PikaStdLib_SysObj_print(self, val, ops);
}
method_typedef(
    PikaStdLib_SysObj_print,
    "print", "*val,**ops"
);

void PikaStdLib_SysObj_rangeMethod(PikaObj *self, Args *args){
    PikaTuple* ax = args_getTuple(args, "ax");
    Arg* res = PikaStdLib_SysObj_range(self, ax);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_SysObj_range,
    "range", "*ax"
);

void PikaStdLib_SysObj_setattrMethod(PikaObj *self, Args *args){
    PikaObj* obj = args_getPtr(args, "obj");
    char* name = args_getStr(args, "name");
    Arg* val = args_getArg(args, "val");
    PikaStdLib_SysObj_setattr(self, obj, name, val);
}
method_typedef(
    PikaStdLib_SysObj_setattr,
    "setattr", "obj,name,val"
);

void PikaStdLib_SysObj_strMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    char* res = PikaStdLib_SysObj_str(self, arg);
    method_returnStr(args, res);
}
method_typedef(
    PikaStdLib_SysObj_str,
    "str", "arg"
);

void PikaStdLib_SysObj_typeMethod(PikaObj *self, Args *args){
    Arg* arg = args_getArg(args, "arg");
    Arg* res = PikaStdLib_SysObj_type(self, arg);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdLib_SysObj_type,
    "type", "arg"
);

class_def(PikaStdLib_SysObj){
    __BEFORE_MOETHOD_DEF
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_id, 5863474),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_chr, 193488354),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_dir, 193489476),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_hex, 193493706),
#endif
    method_def(PikaStdLib_SysObj_int, 193495088),
    method_def(PikaStdLib_SysObj_len, 193498052),
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_ord, 193501738),
#endif
    method_def(PikaStdLib_SysObj_str, 193506174),
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_setattr, 204224428),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_bytes, 254850636),
#endif
    method_def(PikaStdLib_SysObj_float, 259121563),
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_input, 262752949),
#endif
    method_def(PikaStdLib_SysObj_print, 271190290),
    method_def(PikaStdLib_SysObj_range, 272956402),
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_hasattr, 872734812),
#endif
#if PIKA_SYNTAX_FORMAT_ENABLE
    method_def(PikaStdLib_SysObj_cformat, 1049381873),
#endif
    method_def(PikaStdLib_SysObj___setitem__, 1364865276),
    method_def(PikaStdLib_SysObj___getitem__, 1535436016),
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_getattr, 1886477984),
#endif
#if PIKA_BUILTIN_STRUCT_ENABLE
    method_def(PikaStdLib_SysObj_dict, 2090185033),
#endif
#if PIKA_EXEC_ENABLE
    method_def(PikaStdLib_SysObj_eval, 2090235053),
#endif
#if PIKA_EXEC_ENABLE
    method_def(PikaStdLib_SysObj_exec, 2090237354),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_exit, 2090237503),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_help, 2090324718),
#endif
    method_def(PikaStdLib_SysObj_iter, 2090376761),
#if PIKA_BUILTIN_STRUCT_ENABLE
    method_def(PikaStdLib_SysObj_list, 2090473057),
#endif
#if PIKA_FILEIO_ENABLE
    method_def(PikaStdLib_SysObj_open, 2090588023),
#endif
#if !PIKA_NANO_ENABLE
    method_def(PikaStdLib_SysObj_type, 2090777863),
#endif
};
class_inhert(PikaStdLib_SysObj, TinyObj);

PikaObj *New_PikaStdLib_SysObj(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdLib_SysObj);
    return self;
}

Arg *PikaStdLib_SysObj(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdLib_SysObj);
}
#endif

#ifndef PIKA_MODULE_PIKASTDTASK_DISABLE
void PikaStdTask_TaskMethod(PikaObj *self, Args *args){
    Arg* res = PikaStdTask_Task(self);
    method_returnArg(args, res);
}
method_typedef(
    PikaStdTask_Task,
    "Task", ""
);

class_def(PikaStdTask){
    __BEFORE_MOETHOD_DEF
    constructor_def(PikaStdTask_Task, 2089601848),
};
class_inhert(PikaStdTask, TinyObj);

