QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
PikaObj *New_PikaStdTask(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, PikaStdTask);
    return self;
}
#endif

#ifndef PIKA_MODULE_PIKASTDTASK_DISABLE
void PikaStdTask_Task___init__Method(PikaObj *self, Args *args){
    PikaStdTask_Task___init__(self);
}
method_typedef(
    PikaStdTask_Task___init__,
    "__init__", ""
);

void PikaStdTask_Task_call_alwaysMethod(PikaObj *self, Args *args){
    Arg* fun_todo = args_getArg(args, "fun_todo");
    PikaStdTask_Task_call_always(self, fun_todo);
}
method_typedef(
    PikaStdTask_Task_call_always,
    "call_always", "fun_todo"
);

void PikaStdTask_Task_call_period_msMethod(PikaObj *self, Args *args){
    Arg* fun_todo = args_getArg(args, "fun_todo");
    int period_ms = args_getInt(args, "period_ms");
    PikaStdTask_Task_call_period_ms(self, fun_todo, period_ms);
}
method_typedef(
    PikaStdTask_Task_call_period_ms,
    "call_period_ms", "fun_todo,period_ms"
);

void PikaStdTask_Task_call_whenMethod(PikaObj *self, Args *args){
    Arg* fun_todo = args_getArg(args, "fun_todo");
    Arg* fun_when = args_getArg(args, "fun_when");
    PikaStdTask_Task_call_when(self, fun_todo, fun_when);
}
method_typedef(
    PikaStdTask_Task_call_when,
    "call_when", "fun_todo,fun_when"
);

void PikaStdTask_Task_platformGetTickMethod(PikaObj *self, Args *args){
    PikaStdTask_Task_platformGetTick(self);
}
method_typedef(
    PikaStdTask_Task_platformGetTick,
    "platformGetTick", ""
);

void PikaStdTask_Task_run_foreverMethod(PikaObj *self, Args *args){
    PikaStdTask_Task_run_forever(self);
}
method_typedef(
    PikaStdTask_Task_run_forever,
    "run_forever", ""
);

void PikaStdTask_Task_run_onceMethod(PikaObj *self, Args *args){
    PikaStdTask_Task_run_once(self);
}
method_typedef(
    PikaStdTask_Task_run_once,
    "run_once", ""
);

void PikaStdTask_Task_run_until_msMethod(PikaObj *self, Args *args){
    int until_ms = args_getInt(args, "until_ms");
    PikaStdTask_Task_run_until_ms(self, until_ms);
}
method_typedef(
    PikaStdTask_Task_run_until_ms,
    "run_until_ms", "until_ms"
);

class_def(PikaStdTask_Task){
    __BEFORE_MOETHOD_DEF
    method_def(PikaStdTask_Task_run_forever, 408322738),
    method_def(PikaStdTask_Task_run_until_ms, 854930212),
    method_def(PikaStdTask_Task___init__, 904762485),
    method_def(PikaStdTask_Task_call_always, 1368427953),
    method_def(PikaStdTask_Task_call_period_ms, 1674236450),
    method_def(PikaStdTask_Task_run_once, 1726949022),
    method_def(PikaStdTask_Task_platformGetTick, 1897947957),
    method_def(PikaStdTask_Task_call_when, 2141638002),
};
class_inhert(PikaStdTask_Task, PikaStdLib_SysObj);

PikaObj *New_PikaStdTask_Task(Args *args){
    PikaObj *self = New_PikaStdLib_SysObj(args);
    obj_newObj(self, "calls", "PikaStdData_List", New_PikaStdData_List);
    obj_setClass(self, PikaStdTask_Task);
    return self;
}

Arg *PikaStdTask_Task(PikaObj *self){
    return obj_newObjInPackage(New_PikaStdTask_Task);
}
#endif

#ifndef PIKA_MODULE_STM32F1_DISABLE
void STM32F1_ADCMethod(PikaObj *self, Args *args){
    Arg* res = STM32F1_ADC(self);
    method_returnArg(args, res);
}
method_typedef(
    STM32F1_ADC,
    "ADC", ""
);

void STM32F1_GPIOMethod(PikaObj *self, Args *args){
    Arg* res = STM32F1_GPIO(self);
    method_returnArg(args, res);
}
method_typedef(
    STM32F1_GPIO,
    "GPIO", ""
);

void STM32F1_IICMethod(PikaObj *self, Args *args){
    Arg* res = STM32F1_IIC(self);
    method_returnArg(args, res);
}
method_typedef(
    STM32F1_IIC,
    "IIC", ""
);

void STM32F1_PWMMethod(PikaObj *self, Args *args){
    Arg* res = STM32F1_PWM(self);
    method_returnArg(args, res);
}
method_typedef(
    STM32F1_PWM,
    "PWM", ""
);

void STM32F1_TimeMethod(PikaObj *self, Args *args){
    Arg* res = STM32F1_Time(self);
    method_returnArg(args, res);
}
method_typedef(
    STM32F1_Time,
    "Time", ""
);

void STM32F1_UARTMethod(PikaObj *self, Args *args){
    Arg* res = STM32F1_UART(self);
    method_returnArg(args, res);
}
method_typedef(
    STM32F1_UART,
    "UART", ""
);

void STM32F1_lowLevelMethod(PikaObj *self, Args *args){
    Arg* res = STM32F1_lowLevel(self);
    method_returnArg(args, res);
}
method_typedef(
    STM32F1_lowLevel,
    "lowLevel", ""
);

class_def(STM32F1){
    __BEFORE_MOETHOD_DEF
    constructor_def(STM32F1_ADC, 193450093),
    constructor_def(STM32F1_IIC, 193458970),
    constructor_def(STM32F1_PWM, 193467065),
    constructor_def(STM32F1_lowLevel, 589823855),
    constructor_def(STM32F1_GPIO, 2089114740),
    constructor_def(STM32F1_UART, 2089601825),
    constructor_def(STM32F1_Time, 2089610356),
};
class_inhert(STM32F1, TinyObj);

PikaObj *New_STM32F1(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, STM32F1);
    return self;
}
#endif

#ifndef PIKA_MODULE_STM32F1_DISABLE
void STM32F1_ADC_platformEnableMethod(PikaObj *self, Args *args){
    STM32F1_ADC_platformEnable(self);
}
method_typedef(
    STM32F1_ADC_platformEnable,
    "platformEnable", ""
);

void STM32F1_ADC_platformReadMethod(PikaObj *self, Args *args){
    STM32F1_ADC_platformRead(self);
}
method_typedef(
    STM32F1_ADC_platformRead,
    "platformRead", ""
);

class_def(STM32F1_ADC){
    __BEFORE_MOETHOD_DEF
    method_def(STM32F1_ADC_platformEnable, 835227025),
    method_def(STM32F1_ADC_platformRead, 1797695974),
};
class_inhert(STM32F1_ADC, PikaStdDevice_ADC);

PikaObj *New_STM32F1_ADC(Args *args){
    PikaObj *self = New_PikaStdDevice_ADC(args);
    obj_setClass(self, STM32F1_ADC);
    return self;
}

Arg *STM32F1_ADC(PikaObj *self){
    return obj_newObjInPackage(New_STM32F1_ADC);
}
#endif

#ifndef PIKA_MODULE_STM32F1_DISABLE
void STM32F1_GPIO_platformDisableMethod(PikaObj *self, Args *args){
    STM32F1_GPIO_platformDisable(self);
}
method_typedef(
    STM32F1_GPIO_platformDisable,
    "platformDisable", ""
);

void STM32F1_GPIO_platformEnableMethod(PikaObj *self, Args *args){
    STM32F1_GPIO_platformEnable(self);
}
method_typedef(
    STM32F1_GPIO_platformEnable,
    "platformEnable", ""
);

