QGB/pikapython_stm32f103c8/pikascript/pikascript-api/__pikaBinding.c
void STM32F1_GPIO_platformHighMethod(PikaObj *self, Args *args){
    STM32F1_GPIO_platformHigh(self);
}
method_typedef(
    STM32F1_GPIO_platformHigh,
    "platformHigh", ""
);

void STM32F1_GPIO_platformLowMethod(PikaObj *self, Args *args){
    STM32F1_GPIO_platformLow(self);
}
method_typedef(
    STM32F1_GPIO_platformLow,
    "platformLow", ""
);

void STM32F1_GPIO_platformReadMethod(PikaObj *self, Args *args){
    STM32F1_GPIO_platformRead(self);
}
method_typedef(
    STM32F1_GPIO_platformRead,
    "platformRead", ""
);

void STM32F1_GPIO_platformSetModeMethod(PikaObj *self, Args *args){
    STM32F1_GPIO_platformSetMode(self);
}
method_typedef(
    STM32F1_GPIO_platformSetMode,
    "platformSetMode", ""
);

class_def(STM32F1_GPIO){
    __BEFORE_MOETHOD_DEF
    method_def(STM32F1_GPIO_platformSetMode, 215449403),
    method_def(STM32F1_GPIO_platformDisable, 326843198),
    method_def(STM32F1_GPIO_platformEnable, 835227025),
    method_def(STM32F1_GPIO_platformLow, 1616275740),
    method_def(STM32F1_GPIO_platformHigh, 1797341162),
    method_def(STM32F1_GPIO_platformRead, 1797695974),
};
class_inhert(STM32F1_GPIO, PikaStdDevice_GPIO);

PikaObj *New_STM32F1_GPIO(Args *args){
    PikaObj *self = New_PikaStdDevice_GPIO(args);
    obj_setClass(self, STM32F1_GPIO);
    return self;
}

Arg *STM32F1_GPIO(PikaObj *self){
    return obj_newObjInPackage(New_STM32F1_GPIO);
}
#endif

#ifndef PIKA_MODULE_STM32F1_DISABLE
void STM32F1_IIC_platformEnableMethod(PikaObj *self, Args *args){
    STM32F1_IIC_platformEnable(self);
}
method_typedef(
    STM32F1_IIC_platformEnable,
    "platformEnable", ""
);

void STM32F1_IIC_platformReadMethod(PikaObj *self, Args *args){
    STM32F1_IIC_platformRead(self);
}
method_typedef(
    STM32F1_IIC_platformRead,
    "platformRead", ""
);

void STM32F1_IIC_platformWriteMethod(PikaObj *self, Args *args){
    STM32F1_IIC_platformWrite(self);
}
method_typedef(
    STM32F1_IIC_platformWrite,
    "platformWrite", ""
);

class_def(STM32F1_IIC){
    __BEFORE_MOETHOD_DEF
    method_def(STM32F1_IIC_platformEnable, 835227025),
    method_def(STM32F1_IIC_platformWrite, 1348314773),
    method_def(STM32F1_IIC_platformRead, 1797695974),
};
class_inhert(STM32F1_IIC, PikaStdDevice_IIC);

PikaObj *New_STM32F1_IIC(Args *args){
    PikaObj *self = New_PikaStdDevice_IIC(args);
    obj_newObj(self, "SCL", "STM32F1_GPIO", New_STM32F1_GPIO);
    obj_newObj(self, "SDA", "STM32F1_GPIO", New_STM32F1_GPIO);
    obj_setClass(self, STM32F1_IIC);
    return self;
}

Arg *STM32F1_IIC(PikaObj *self){
    return obj_newObjInPackage(New_STM32F1_IIC);
}
#endif

#ifndef PIKA_MODULE_STM32F1_DISABLE
void STM32F1_PWM_platformEnableMethod(PikaObj *self, Args *args){
    STM32F1_PWM_platformEnable(self);
}
method_typedef(
    STM32F1_PWM_platformEnable,
    "platformEnable", ""
);

void STM32F1_PWM_platformSetDutyMethod(PikaObj *self, Args *args){
    STM32F1_PWM_platformSetDuty(self);
}
method_typedef(
    STM32F1_PWM_platformSetDuty,
    "platformSetDuty", ""
);

void STM32F1_PWM_platformSetFrequencyMethod(PikaObj *self, Args *args){
    STM32F1_PWM_platformSetFrequency(self);
}
method_typedef(
    STM32F1_PWM_platformSetFrequency,
    "platformSetFrequency", ""
);

class_def(STM32F1_PWM){
    __BEFORE_MOETHOD_DEF
    method_def(STM32F1_PWM_platformSetDuty, 215133052),
    method_def(STM32F1_PWM_platformEnable, 835227025),
    method_def(STM32F1_PWM_platformSetFrequency, 2060729960),
};
class_inhert(STM32F1_PWM, PikaStdDevice_PWM);

PikaObj *New_STM32F1_PWM(Args *args){
    PikaObj *self = New_PikaStdDevice_PWM(args);
    obj_setClass(self, STM32F1_PWM);
    return self;
}

Arg *STM32F1_PWM(PikaObj *self){
    return obj_newObjInPackage(New_STM32F1_PWM);
}
#endif

#ifndef PIKA_MODULE_STM32F1_DISABLE
void STM32F1_Time_sleep_msMethod(PikaObj *self, Args *args){
    int ms = args_getInt(args, "ms");
    STM32F1_Time_sleep_ms(self, ms);
}
method_typedef(
    STM32F1_Time_sleep_ms,
    "sleep_ms", "ms"
);

void STM32F1_Time_sleep_sMethod(PikaObj *self, Args *args){
    int s = args_getInt(args, "s");
    STM32F1_Time_sleep_s(self, s);
}
method_typedef(
    STM32F1_Time_sleep_s,
    "sleep_s", "s"
);

class_def(STM32F1_Time){
    __BEFORE_MOETHOD_DEF
    method_def(STM32F1_Time_sleep_ms, 164842493),
    method_def(STM32F1_Time_sleep_s, 460522064),
};
class_inhert(STM32F1_Time, PikaStdDevice_Time);

PikaObj *New_STM32F1_Time(Args *args){
    PikaObj *self = New_PikaStdDevice_Time(args);
    obj_setClass(self, STM32F1_Time);
    return self;
}

Arg *STM32F1_Time(PikaObj *self){
    return obj_newObjInPackage(New_STM32F1_Time);
}
#endif

#ifndef PIKA_MODULE_STM32F1_DISABLE
void STM32F1_UART_platformEnableMethod(PikaObj *self, Args *args){
    STM32F1_UART_platformEnable(self);
}
method_typedef(
    STM32F1_UART_platformEnable,
    "platformEnable", ""
);

void STM32F1_UART_platformReadMethod(PikaObj *self, Args *args){
    STM32F1_UART_platformRead(self);
}
method_typedef(
    STM32F1_UART_platformRead,
    "platformRead", ""
);

void STM32F1_UART_platformWriteMethod(PikaObj *self, Args *args){
    STM32F1_UART_platformWrite(self);
}
method_typedef(
    STM32F1_UART_platformWrite,
    "platformWrite", ""
);

class_def(STM32F1_UART){
    __BEFORE_MOETHOD_DEF
    method_def(STM32F1_UART_platformEnable, 835227025),
    method_def(STM32F1_UART_platformWrite, 1348314773),
    method_def(STM32F1_UART_platformRead, 1797695974),
};
class_inhert(STM32F1_UART, PikaStdDevice_UART);

PikaObj *New_STM32F1_UART(Args *args){
    PikaObj *self = New_PikaStdDevice_UART(args);
    obj_setClass(self, STM32F1_UART);
    return self;
}

Arg *STM32F1_UART(PikaObj *self){
    return obj_newObjInPackage(New_STM32F1_UART);
}
#endif

#ifndef PIKA_MODULE_STM32F1_DISABLE
void STM32F1_lowLevel_readPinMethod(PikaObj *self, Args *args){
    char* pin = args_getStr(args, "pin");
    int res = STM32F1_lowLevel_readPin(self, pin);
    method_returnInt(args, res);
}
method_typedef(
    STM32F1_lowLevel_readPin,
    "readPin", "pin"
);

class_def(STM32F1_lowLevel){
    __BEFORE_MOETHOD_DEF
    method_def(STM32F1_lowLevel_readPin, 1037775848),
};
class_inhert(STM32F1_lowLevel, TinyObj);

PikaObj *New_STM32F1_lowLevel(Args *args){
    PikaObj *self = New_TinyObj(args);
    obj_setClass(self, STM32F1_lowLevel);
    return self;
}

Arg *STM32F1_lowLevel(PikaObj *self){
    return obj_newObjInPackage(New_STM32F1_lowLevel);
}
#endif

